{
  "paragraphs": [
    "HERMOGENES: Suppose that we make Socrates a party to the argument?",
    "CRATYLUS: If you please.",
    "HERMOGENES: I should explain to you, Socrates, that our friend Cratylus\nhas been arguing about names; he says that they are natural and not\nconventional; not a portion of the human voice which men agree to use;\nbut that there is a truth or correctness in them, which is the same for\nHellenes as for barbarians. Whereupon I ask him, whether his own name\nof Cratylus is a true name or not, and he answers “Yes.” And Socrates?\n“Yes.” Then every man’s name, as I tell him, is that which he is\ncalled. To this he replies—“If all the world were to call you\nHermogenes, that would not be your name.” And when I am anxious to have\na further explanation he is ironical and mysterious, and seems to imply\nthat he has a notion of his own about the matter, if he would only\ntell, and could entirely convince me, if he chose to be intelligible.\nTell me, Socrates, what this oracle means; or rather tell me, if you\nwill be so good, what is your own view of the truth or correctness of\nnames, which I would far sooner hear.",
    "SOCRATES: Son of Hipponicus, there is an ancient saying, that “hard is\nthe knowledge of the good.” And the knowledge of names is a great part\nof knowledge. If I had not been poor, I might have heard the\nfifty-drachma course of the great Prodicus, which is a complete\neducation in grammar and language—these are his own words—and then I\nshould have been at once able to answer your question about the\ncorrectness of names. But, indeed, I have only heard the single-drachma\ncourse, and therefore, I do not know the truth about such matters; I\nwill, however, gladly assist you and Cratylus in the investigation of\nthem. When he declares that your name is not really Hermogenes, I\nsuspect that he is only making fun of you;—he means to say that you are\nno true son of Hermes, because you are always looking after a fortune\nand never in luck. But, as I was saying, there is a good deal of\ndifficulty in this sort of knowledge, and therefore we had better leave\nthe question open until we have heard both sides.",
    "HERMOGENES: I have often talked over this matter, both with Cratylus\nand others, and cannot convince myself that there is any principle of\ncorrectness in names other than convention and agreement; any name\nwhich you give, in my opinion, is the right one, and if you change that\nand give another, the new name is as correct as the old—we frequently\nchange the names of our slaves, and the newly-imposed name is as good\nas the old: for there is no name given to anything by nature; all is\nconvention and habit of the users;—such is my view. But if I am\nmistaken I shall be happy to hear and learn of Cratylus, or of any one\nelse.",
    "SOCRATES: I dare say that you may be right, Hermogenes: let us\nsee;—Your meaning is, that the name of each thing is only that which\nanybody agrees to call it?",
    "HERMOGENES: That is my notion.",
    "SOCRATES: Whether the giver of the name be an individual or a city?",
    "HERMOGENES: Yes.",
    "SOCRATES: Well, now, let me take an instance;—suppose that I call a man\na horse or a horse a man, you mean to say that a man will be rightly\ncalled a horse by me individually, and rightly called a man by the rest\nof the world; and a horse again would be rightly called a man by me and\na horse by the world:—that is your meaning?",
    "HERMOGENES: He would, according to my view.",
    "SOCRATES: But how about truth, then? you would acknowledge that there\nis in words a true and a false?",
    "HERMOGENES: Certainly.",
    "SOCRATES: And there are true and false propositions?",
    "HERMOGENES: To be sure.",
    "SOCRATES: And a true proposition says that which is, and a false\nproposition says that which is not?",
    "HERMOGENES: Yes; what other answer is possible?",
    "SOCRATES: Then in a proposition there is a true and false?",
    "HERMOGENES: Certainly.",
    "SOCRATES: But is a proposition true as a whole only, and are the parts\nuntrue?",
    "HERMOGENES: No; the parts are true as well as the whole.",
    "SOCRATES: Would you say the large parts and not the smaller ones, or\nevery part?",
    "HERMOGENES: I should say that every part is true.",
    "SOCRATES: Is a proposition resolvable into any part smaller than a\nname?",
    "HERMOGENES: No; that is the smallest.",
    "SOCRATES: Then the name is a part of the true proposition?",
    "HERMOGENES: Yes.",
    "SOCRATES: Yes, and a true part, as you say.",
    "HERMOGENES: Yes.",
    "SOCRATES: And is not the part of a falsehood also a falsehood?",
    "HERMOGENES: Yes.",
    "SOCRATES: Then, if propositions may be true and false, names may be\ntrue and false?",
    "HERMOGENES: So we must infer.",
    "SOCRATES: And the name of anything is that which any one affirms to be\nthe name?",
    "HERMOGENES: Yes.",
    "SOCRATES: And will there be so many names of each thing as everybody\nsays that there are? and will they be true names at the time of\nuttering them?",
    "HERMOGENES: Yes, Socrates, I can conceive no correctness of names other\nthan this; you give one name, and I another; and in different cities\nand countries there are different names for the same things; Hellenes\ndiffer from barbarians in their use of names, and the several Hellenic\ntribes from one another.",
    "SOCRATES: But would you say, Hermogenes, that the things differ as the\nnames differ? and are they relative to individuals, as Protagoras tells\nus? For he says that man is the measure of all things, and that things\nare to me as they appear to me, and that they are to you as they appear\nto you. Do you agree with him, or would you say that things have a\npermanent essence of their own?",
    "HERMOGENES: There have been times, Socrates, when I have been driven in\nmy perplexity to take refuge with Protagoras; not that I agree with him\nat all.",
    "SOCRATES: What! have you ever been driven to admit that there was no\nsuch thing as a bad man?",
    "HERMOGENES: No, indeed; but I have often had reason to think that there\nare very bad men, and a good many of them.",
    "SOCRATES: Well, and have you ever found any very good ones?",
    "HERMOGENES: Not many.",
    "SOCRATES: Still you have found them?",
    "HERMOGENES: Yes.",
    "SOCRATES: And would you hold that the very good were the very wise, and\nthe very evil very foolish? Would that be your view?",
    "HERMOGENES: It would.",
    "SOCRATES: But if Protagoras is right, and the truth is that things are\nas they appear to any one, how can some of us be wise and some of us\nfoolish?",
    "HERMOGENES: Impossible.",
    "SOCRATES: And if, on the other hand, wisdom and folly are really\ndistinguishable, you will allow, I think, that the assertion of\nProtagoras can hardly be correct. For if what appears to each man is\ntrue to him, one man cannot in reality be wiser than another.",
    "HERMOGENES: He cannot.",
    "SOCRATES: Nor will you be disposed to say with Euthydemus, that all\nthings equally belong to all men at the same moment and always; for\nneither on his view can there be some good and others bad, if virtue\nand vice are always equally to be attributed to all.",
    "HERMOGENES: There cannot.",
    "SOCRATES: But if neither is right, and things are not relative to\nindividuals, and all things do not equally belong to all at the same\nmoment and always, they must be supposed to have their own proper and\npermanent essence: they are not in relation to us, or influenced by us,\nfluctuating according to our fancy, but they are independent, and\nmaintain to their own essence the relation prescribed by nature.",
    "HERMOGENES: I think, Socrates, that you have said the truth.",
    "SOCRATES: Does what I am saying apply only to the things themselves, or\nequally to the actions which proceed from them? Are not actions also a\nclass of being?",
    "HERMOGENES: Yes, the actions are real as well as the things.",
    "SOCRATES: Then the actions also are done according to their proper\nnature, and not according to our opinion of them? In cutting, for\nexample, we do not cut as we please, and with any chance instrument;\nbut we cut with the proper instrument only, and according to the\nnatural process of cutting; and the natural process is right and will\nsucceed, but any other will fail and be of no use at all.",
    "HERMOGENES: I should say that the natural way is the right way.",
    "SOCRATES: Again, in burning, not every way is the right way; but the\nright way is the natural way, and the right instrument the natural\ninstrument.",
    "HERMOGENES: True.",
    "SOCRATES: And this holds good of all actions?",
    "HERMOGENES: Yes.",
    "SOCRATES: And speech is a kind of action?",
    "HERMOGENES: True.",
    "SOCRATES: And will a man speak correctly who speaks as he pleases? Will\nnot the successful speaker rather be he who speaks in the natural way\nof speaking, and as things ought to be spoken, and with the natural\ninstrument? Any other mode of speaking will result in error and\nfailure.",
    "HERMOGENES: I quite agree with you.",
    "SOCRATES: And is not naming a part of speaking? for in giving names men\nspeak.",
    "HERMOGENES: That is true.",
    "SOCRATES: And if speaking is a sort of action and has a relation to\nacts, is not naming also a sort of action?",
    "HERMOGENES: True.",
    "SOCRATES: And we saw that actions were not relative to ourselves, but\nhad a special nature of their own?",
    "HERMOGENES: Precisely.",
    "SOCRATES: Then the argument would lead us to infer that names ought to\nbe given according to a natural process, and with a proper instrument,\nand not at our pleasure: in this and no other way shall we name with\nsuccess.",
    "HERMOGENES: I agree.",
    "SOCRATES: But again, that which has to be cut has to be cut with\nsomething?",
    "HERMOGENES: Yes.",
    "SOCRATES: And that which has to be woven or pierced has to be woven or\npierced with something?",
    "HERMOGENES: Certainly.",
    "SOCRATES: And that which has to be named has to be named with\nsomething?",
    "HERMOGENES: True.",
    "SOCRATES: What is that with which we pierce?",
    "HERMOGENES: An awl.",
    "SOCRATES: And with which we weave?",
    "HERMOGENES: A shuttle.",
    "SOCRATES: And with which we name?",
    "HERMOGENES: A name.",
    "SOCRATES: Very good: then a name is an instrument?",
    "HERMOGENES: Certainly.",
    "SOCRATES: Suppose that I ask, “What sort of instrument is a shuttle?”\nAnd you answer, “A weaving instrument.”",
    "HERMOGENES: Well.",
    "SOCRATES: And I ask again, “What do we do when we weave?”—The answer\nis, that we separate or disengage the warp from the woof.",
    "HERMOGENES: Very true.",
    "SOCRATES: And may not a similar description be given of an awl, and of\ninstruments in general?",
    "HERMOGENES: To be sure.",
    "SOCRATES: And now suppose that I ask a similar question about names:\nwill you answer me? Regarding the name as an instrument, what do we do\nwhen we name?",
    "HERMOGENES: I cannot say.",
    "SOCRATES: Do we not give information to one another, and distinguish\nthings according to their natures?",
    "HERMOGENES: Certainly we do.",
    "SOCRATES: Then a name is an instrument of teaching and of\ndistinguishing natures, as the shuttle is of distinguishing the threads\nof the web.",
    "HERMOGENES: Yes.",
    "SOCRATES: And the shuttle is the instrument of the weaver?",
    "HERMOGENES: Assuredly.",
    "SOCRATES: Then the weaver will use the shuttle well—and well means like\na weaver? and the teacher will use the name well—and well means like a\nteacher?",
    "HERMOGENES: Yes.",
    "SOCRATES: And when the weaver uses the shuttle, whose work will he be\nusing well?",
    "HERMOGENES: That of the carpenter.",
    "SOCRATES: And is every man a carpenter, or the skilled only?",
    "HERMOGENES: Only the skilled.",
    "SOCRATES: And when the piercer uses the awl, whose work will he be\nusing well?",
    "HERMOGENES: That of the smith.",
    "SOCRATES: And is every man a smith, or only the skilled?",
    "HERMOGENES: The skilled only.",
    "SOCRATES: And when the teacher uses the name, whose work will he be\nusing?",
    "HERMOGENES: There again I am puzzled.",
    "SOCRATES: Cannot you at least say who gives us the names which we use?",
    "HERMOGENES: Indeed I cannot.",
    "SOCRATES: Does not the law seem to you to give us them?",
    "HERMOGENES: Yes, I suppose so.",
    "SOCRATES: Then the teacher, when he gives us a name, uses the work of\nthe legislator?",
    "HERMOGENES: I agree.",
    "SOCRATES: And is every man a legislator, or the skilled only?",
    "HERMOGENES: The skilled only.",
    "SOCRATES: Then, Hermogenes, not every man is able to give a name, but\nonly a maker of names; and this is the legislator, who of all skilled\nartisans in the world is the rarest.",
    "HERMOGENES: True.",
    "SOCRATES: And how does the legislator make names? and to what does he\nlook? Consider this in the light of the previous instances: to what\ndoes the carpenter look in making the shuttle? Does he not look to that\nwhich is naturally fitted to act as a shuttle?",
    "HERMOGENES: Certainly.",
    "SOCRATES: And suppose the shuttle to be broken in making, will he make\nanother, looking to the broken one? or will he look to the form\naccording to which he made the other?",
    "HERMOGENES: To the latter, I should imagine.",
    "SOCRATES: Might not that be justly called the true or ideal shuttle?",
    "HERMOGENES: I think so.",
    "SOCRATES: And whatever shuttles are wanted, for the manufacture of\ngarments, thin or thick, of flaxen, woollen, or other material, ought\nall of them to have the true form of the shuttle; and whatever is the\nshuttle best adapted to each kind of work, that ought to be the form\nwhich the maker produces in each case.",
    "HERMOGENES: Yes.",
    "SOCRATES: And the same holds of other instruments: when a man has\ndiscovered the instrument which is naturally adapted to each work, he\nmust express this natural form, and not others which he fancies, in the\nmaterial, whatever it may be, which he employs; for example, he ought\nto know how to put into iron the forms of awls adapted by nature to\ntheir several uses?",
    "HERMOGENES: Certainly.",
    "SOCRATES: And how to put into wood forms of shuttles adapted by nature\nto their uses?",
    "HERMOGENES: True.",
    "SOCRATES: For the several forms of shuttles naturally answer to the\nseveral kinds of webs; and this is true of instruments in general.",
    "HERMOGENES: Yes.",
    "SOCRATES: Then, as to names: ought not our legislator also to know how\nto put the true natural name of each thing into sounds and syllables,\nand to make and give all names with a view to the ideal name, if he is\nto be a namer in any true sense? And we must remember that different\nlegislators will not use the same syllables. For neither does every\nsmith, although he may be making the same instrument for the same\npurpose, make them all of the same iron. The form must be the same, but\nthe material may vary, and still the instrument may be equally good of\nwhatever iron made, whether in Hellas or in a foreign country;—there is\nno difference.",
    "HERMOGENES: Very true.",
    "SOCRATES: And the legislator, whether he be Hellene or barbarian, is\nnot therefore to be deemed by you a worse legislator, provided he gives\nthe true and proper form of the name in whatever syllables; this or\nthat country makes no matter.",
    "HERMOGENES: Quite true.",
    "SOCRATES: But who then is to determine whether the proper form is given\nto the shuttle, whatever sort of wood may be used? the carpenter who\nmakes, or the weaver who is to use them?",
    "HERMOGENES: I should say, he who is to use them, Socrates.",
    "SOCRATES: And who uses the work of the lyre-maker? Will not he be the\nman who knows how to direct what is being done, and who will know also\nwhether the work is being well done or not?",
    "HERMOGENES: Certainly.",
    "SOCRATES: And who is he?",
    "HERMOGENES: The player of the lyre.",
    "SOCRATES: And who will direct the shipwright?",
    "HERMOGENES: The pilot.",
    "SOCRATES: And who will be best able to direct the legislator in his\nwork, and will know whether the work is well done, in this or any other\ncountry? Will not the user be the man?",
    "HERMOGENES: Yes.",
    "SOCRATES: And this is he who knows how to ask questions?",
    "HERMOGENES: Yes.",
    "SOCRATES: And how to answer them?",
    "HERMOGENES: Yes.",
    "SOCRATES: And him who knows how to ask and answer you would call a\ndialectician?",
    "HERMOGENES: Yes; that would be his name.",
    "SOCRATES: Then the work of the carpenter is to make a rudder, and the\npilot has to direct him, if the rudder is to be well made.",
    "HERMOGENES: True.",
    "SOCRATES: And the work of the legislator is to give names, and the\ndialectician must be his director if the names are to be rightly given?",
    "HERMOGENES: That is true.",
    "SOCRATES: Then, Hermogenes, I should say that this giving of names can\nbe no such light matter as you fancy, or the work of light or chance\npersons; and Cratylus is right in saying that things have names by\nnature, and that not every man is an artificer of names, but he only\nwho looks to the name which each thing by nature has, and is able to\nexpress the true forms of things in letters and syllables.",
    "HERMOGENES: I cannot answer you, Socrates; but I find a difficulty in\nchanging my opinion all in a moment, and I think that I should be more\nreadily persuaded, if you would show me what this is which you term the\nnatural fitness of names.",
    "SOCRATES: My good Hermogenes, I have none to show. Was I not telling\nyou just now (but you have forgotten), that I knew nothing, and\nproposing to share the enquiry with you? But now that you and I have\ntalked over the matter, a step has been gained; for we have discovered\nthat names have by nature a truth, and that not every man knows how to\ngive a thing a name.",
    "HERMOGENES: Very good.",
    "SOCRATES: And what is the nature of this truth or correctness of names?\nThat, if you care to know, is the next question.",
    "HERMOGENES: Certainly, I care to know.",
    "SOCRATES: Then reflect.",
    "HERMOGENES: How shall I reflect?",
    "SOCRATES: The true way is to have the assistance of those who know, and\nyou must pay them well both in money and in thanks; these are the\nSophists, of whom your brother, Callias, has—rather dearly—bought the\nreputation of wisdom. But you have not yet come into your inheritance,\nand therefore you had better go to him, and beg and entreat him to tell\nyou what he has learnt from Protagoras about the fitness of names.",
    "HERMOGENES: But how inconsistent should I be, if, whilst repudiating\nProtagoras and his truth (“Truth” was the title of the book of\nProtagoras; compare Theaet.), I were to attach any value to what he and\nhis book affirm!",
    "SOCRATES: Then if you despise him, you must learn of Homer and the\npoets.",
    "HERMOGENES: And where does Homer say anything about names, and what\ndoes he say?",
    "SOCRATES: He often speaks of them; notably and nobly in the places\nwhere he distinguishes the different names which Gods and men give to\nthe same things. Does he not in these passages make a remarkable\nstatement about the correctness of names? For the Gods must clearly be\nsupposed to call things by their right and natural names; do you not\nthink so?",
    "HERMOGENES: Why, of course they call them rightly, if they call them at\nall. But to what are you referring?",
    "SOCRATES: Do you not know what he says about the river in Troy who had\na single combat with Hephaestus?",
    "“Whom,” as he says, “the Gods call Xanthus, and men call Scamander.”",
    "HERMOGENES: I remember.",
    "SOCRATES: Well, and about this river—to know that he ought to be called\nXanthus and not Scamander—is not that a solemn lesson? Or about the\nbird which, as he says,",
    "“The Gods call Chalcis, and men Cymindis:”",
    "to be taught how much more correct the name Chalcis is than the name\nCymindis—do you deem that a light matter? Or about Batieia and Myrina?\n(Compare Il. “The hill which men call Batieia and the immortals the\ntomb of the sportive Myrina.”) And there are many other observations of\nthe same kind in Homer and other poets. Now, I think that this is\nbeyond the understanding of you and me; but the names of Scamandrius\nand Astyanax, which he affirms to have been the names of Hector’s son,\nare more within the range of human faculties, as I am disposed to\nthink; and what the poet means by correctness may be more readily\napprehended in that instance: you will remember I dare say the lines to\nwhich I refer? (Il.)",
    "HERMOGENES: I do.",
    "SOCRATES: Let me ask you, then, which did Homer think the more correct\nof the names given to Hector’s son—Astyanax or Scamandrius?",
    "HERMOGENES: I do not know.",
    "SOCRATES: How would you answer, if you were asked whether the wise or\nthe unwise are more likely to give correct names?",
    "HERMOGENES: I should say the wise, of course.",
    "SOCRATES: And are the men or the women of a city, taken as a class, the\nwiser?",
    "HERMOGENES: I should say, the men.",
    "SOCRATES: And Homer, as you know, says that the Trojan men called him\nAstyanax (king of the city); but if the men called him Astyanax, the\nother name of Scamandrius could only have been given to him by the\nwomen.",
    "HERMOGENES: That may be inferred.",
    "SOCRATES: And must not Homer have imagined the Trojans to be wiser than\ntheir wives?",
    "HERMOGENES: To be sure.",
    "SOCRATES: Then he must have thought Astyanax to be a more correct name\nfor the boy than Scamandrius?",
    "HERMOGENES: Clearly.",
    "SOCRATES: And what is the reason of this? Let us consider:—does he not\nhimself suggest a very good reason, when he says,",
    "“For he alone defended their city and long walls”?",
    "This appears to be a good reason for calling the son of the saviour\nking of the city which his father was saving, as Homer observes.",
    "HERMOGENES: I see.",
    "SOCRATES: Why, Hermogenes, I do not as yet see myself; and do you?",
    "HERMOGENES: No, indeed; not I.",
    "SOCRATES: But tell me, friend, did not Homer himself also give Hector\nhis name?",
    "HERMOGENES: What of that?",
    "SOCRATES: The name appears to me to be very nearly the same as the name\nof Astyanax—both are Hellenic; and a king (anax) and a holder (ektor)\nhave nearly the same meaning, and are both descriptive of a king; for a\nman is clearly the holder of that of which he is king; he rules, and\nowns, and holds it. But, perhaps, you may think that I am talking\nnonsense; and indeed I believe that I myself did not know what I meant\nwhen I imagined that I had found some indication of the opinion of\nHomer about the correctness of names.",
    "HERMOGENES: I assure you that I think otherwise, and I believe you to\nbe on the right track.",
    "SOCRATES: There is reason, I think, in calling the lion’s whelp a lion,\nand the foal of a horse a horse; I am speaking only of the ordinary\ncourse of nature, when an animal produces after his kind, and not of\nextraordinary births;—if contrary to nature a horse have a calf, then I\nshould not call that a foal but a calf; nor do I call any inhuman birth\na man, but only a natural birth. And the same may be said of trees and\nother things. Do you agree with me?",
    "HERMOGENES: Yes, I agree.",
    "SOCRATES: Very good. But you had better watch me and see that I do not\nplay tricks with you. For on the same principle the son of a king is to\nbe called a king. And whether the syllables of the name are the same or\nnot the same, makes no difference, provided the meaning is retained;\nnor does the addition or subtraction of a letter make any difference so\nlong as the essence of the thing remains in possession of the name and\nappears in it.",
    "HERMOGENES: What do you mean?",
    "SOCRATES: A very simple matter. I may illustrate my meaning by the\nnames of letters, which you know are not the same as the letters\nthemselves with the exception of the four epsilon, upsilon, omicron,\nomega; the names of the rest, whether vowels or consonants, are made up\nof other letters which we add to them; but so long as we introduce the\nmeaning, and there can be no mistake, the name of the letter is quite\ncorrect. Take, for example, the letter beta—the addition of eta, tau,\nalpha, gives no offence, and does not prevent the whole name from\nhaving the value which the legislator intended—so well did he know how\nto give the letters names.",
    "HERMOGENES: I believe you are right.",
    "SOCRATES: And may not the same be said of a king? a king will often be\nthe son of a king, the good son or the noble son of a good or noble\nsire; and similarly the offspring of every kind, in the regular course\nof nature, is like the parent, and therefore has the same name. Yet the\nsyllables may be disguised until they appear different to the ignorant\nperson, and he may not recognize them, although they are the same, just\nas any one of us would not recognize the same drugs under different\ndisguises of colour and smell, although to the physician, who regards\nthe power of them, they are the same, and he is not put out by the\naddition; and in like manner the etymologist is not put out by the\naddition or transposition or subtraction of a letter or two, or indeed\nby the change of all the letters, for this need not interfere with the\nmeaning. As was just now said, the names of Hector and Astyanax have\nonly one letter alike, which is tau, and yet they have the same\nmeaning. And how little in common with the letters of their names has\nArchepolis (ruler of the city)—and yet the meaning is the same. And\nthere are many other names which just mean “king.” Again, there are\nseveral names for a general, as, for example, Agis (leader) and\nPolemarchus (chief in war) and Eupolemus (good warrior); and others\nwhich denote a physician, as Iatrocles (famous healer) and Acesimbrotus\n(curer of mortals); and there are many others which might be cited,\ndiffering in their syllables and letters, but having the same meaning.\nWould you not say so?",
    "HERMOGENES: Yes.",
    "SOCRATES: The same names, then, ought to be assigned to those who\nfollow in the course of nature?",
    "HERMOGENES: Yes.",
    "SOCRATES: And what of those who follow out of the course of nature, and\nare prodigies? for example, when a good and religious man has an\nirreligious son, he ought to bear the name not of his father, but of\nthe class to which he belongs, just as in the case which was before\nsupposed of a horse foaling a calf.",
    "HERMOGENES: Quite true.",
    "SOCRATES: Then the irreligious son of a religious father should be\ncalled irreligious?",
    "HERMOGENES: Certainly.",
    "SOCRATES: He should not be called Theophilus (beloved of God) or\nMnesitheus (mindful of God), or any of these names: if names are\ncorrectly given, his should have an opposite meaning.",
    "HERMOGENES: Certainly, Socrates.",
    "SOCRATES: Again, Hermogenes, there is Orestes (the man of the\nmountains) who appears to be rightly called; whether chance gave the\nname, or perhaps some poet who meant to express the brutality and\nfierceness and mountain wildness of his hero’s nature.",
    "HERMOGENES: That is very likely, Socrates.",
    "SOCRATES: And his father’s name is also according to nature.",
    "HERMOGENES: Clearly.",
    "SOCRATES: Yes, for as his name, so also is his nature; Agamemnon\n(admirable for remaining) is one who is patient and persevering in the\naccomplishment of his resolves, and by his virtue crowns them; and his\ncontinuance at Troy with all the vast army is a proof of that admirable\nendurance in him which is signified by the name Agamemnon. I also think\nthat Atreus is rightly called; for his murder of Chrysippus and his\nexceeding cruelty to Thyestes are damaging and destructive to his\nreputation—the name is a little altered and disguised so as not to be\nintelligible to every one, but to the etymologist there is no\ndifficulty in seeing the meaning, for whether you think of him as\nateires the stubborn, or as atrestos the fearless, or as ateros the\ndestructive one, the name is perfectly correct in every point of view.\nAnd I think that Pelops is also named appropriately; for, as the name\nimplies, he is rightly called Pelops who sees what is near only (o ta\npelas oron).",
    "HERMOGENES: How so?",
    "SOCRATES: Because, according to the tradition, he had no forethought or\nforesight of all the evil which the murder of Myrtilus would entail\nupon his whole race in remote ages; he saw only what was at hand and\nimmediate,—or in other words, pelas (near), in his eagerness to win\nHippodamia by all means for his bride. Every one would agree that the\nname of Tantalus is rightly given and in accordance with nature, if the\ntraditions about him are true.",
    "HERMOGENES: And what are the traditions?",
    "SOCRATES: Many terrible misfortunes are said to have happened to him in\nhis life—last of all, came the utter ruin of his country; and after his\ndeath he had the stone suspended (talanteia) over his head in the world\nbelow—all this agrees wonderfully well with his name. You might imagine\nthat some person who wanted to call him Talantatos (the most weighted\ndown by misfortune), disguised the name by altering it into Tantalus;\nand into this form, by some accident of tradition, it has actually been\ntransmuted. The name of Zeus, who is his alleged father, has also an\nexcellent meaning, although hard to be understood, because really like\na sentence, which is divided into two parts, for some call him Zena,\nand use the one half, and others who use the other half call him Dia;\nthe two together signify the nature of the God, and the business of a\nname, as we were saying, is to express the nature. For there is none\nwho is more the author of life to us and to all, than the lord and king\nof all. Wherefore we are right in calling him Zena and Dia, which are\none name, although divided, meaning the God through whom all creatures\nalways have life (di on zen aei pasi tois zosin uparchei). There is an\nirreverence, at first sight, in calling him son of Cronos (who is a\nproverb for stupidity), and we might rather expect Zeus to be the child\nof a mighty intellect. Which is the fact; for this is the meaning of\nhis father’s name: Kronos quasi Koros (Choreo, to sweep), not in the\nsense of a youth, but signifying to chatharon chai acheraton tou nou,\nthe pure and garnished mind (sc. apo tou chorein). He, as we are\ninformed by tradition, was begotten of Uranus, rightly so called (apo\ntou oran ta ano) from looking upwards; which, as philosophers tell us,\nis the way to have a pure mind, and the name Uranus is therefore\ncorrect. If I could remember the genealogy of Hesiod, I would have gone\non and tried more conclusions of the same sort on the remoter ancestors\nof the Gods,—then I might have seen whether this wisdom, which has come\nto me all in an instant, I know not whence, will or will not hold good\nto the end.",
    "HERMOGENES: You seem to me, Socrates, to be quite like a prophet newly\ninspired, and to be uttering oracles.",
    "SOCRATES: Yes, Hermogenes, and I believe that I caught the inspiration\nfrom the great Euthyphro of the Prospaltian deme, who gave me a long\nlecture which commenced at dawn: he talked and I listened, and his\nwisdom and enchanting ravishment has not only filled my ears but taken\npossession of my soul, and to-day I shall let his superhuman power work\nand finish the investigation of names—that will be the way; but\nto-morrow, if you are so disposed, we will conjure him away, and make a\npurgation of him, if we can only find some priest or sophist who is\nskilled in purifications of this sort.",
    "HERMOGENES: With all my heart; for am very curious to hear the rest of\nthe enquiry about names.",
    "SOCRATES: Then let us proceed; and where would you have us begin, now\nthat we have got a sort of outline of the enquiry? Are there any names\nwhich witness of themselves that they are not given arbitrarily, but\nhave a natural fitness? The names of heroes and of men in general are\napt to be deceptive because they are often called after ancestors with\nwhose names, as we were saying, they may have no business; or they are\nthe expression of a wish like Eutychides (the son of good fortune), or\nSosias (the Saviour), or Theophilus (the beloved of God), and others.\nBut I think that we had better leave these, for there will be more\nchance of finding correctness in the names of immutable essences;—there\nought to have been more care taken about them when they were named, and\nperhaps there may have been some more than human power at work\noccasionally in giving them names.",
    "HERMOGENES: I think so, Socrates.",
    "SOCRATES: Ought we not to begin with the consideration of the Gods, and\nshow that they are rightly named Gods?",
    "HERMOGENES: Yes, that will be well.",
    "SOCRATES: My notion would be something of this sort:—I suspect that the\nsun, moon, earth, stars, and heaven, which are still the Gods of many\nbarbarians, were the only Gods known to the aboriginal Hellenes. Seeing\nthat they were always moving and running, from their running nature\nthey were called Gods or runners (Theous, Theontas); and when men\nbecame acquainted with the other Gods, they proceeded to apply the same\nname to them all. Do you think that likely?",
    "HERMOGENES: I think it very likely indeed.",
    "SOCRATES: What shall follow the Gods?",
    "HERMOGENES: Must not demons and heroes and men come next?",
    "SOCRATES: Demons! And what do you consider to be the meaning of this\nword? Tell me if my view is right.",
    "HERMOGENES: Let me hear.",
    "SOCRATES: You know how Hesiod uses the word?",
    "HERMOGENES: I do not.",
    "SOCRATES: Do you not remember that he speaks of a golden race of men\nwho came first?",
    "HERMOGENES: Yes, I do.",
    "SOCRATES: He says of them—",
    "“But now that fate has closed over this race They are holy demons upon\nthe earth, Beneficent, averters of ills, guardians of mortal men.”\n(Hesiod, Works and Days.)",
    "HERMOGENES: What is the inference?",
    "SOCRATES: What is the inference! Why, I suppose that he means by the\ngolden men, not men literally made of gold, but good and noble; and I\nam convinced of this, because he further says that we are the iron\nrace.",
    "HERMOGENES: That is true.",
    "SOCRATES: And do you not suppose that good men of our own day would by\nhim be said to be of golden race?",
    "HERMOGENES: Very likely.",
    "SOCRATES: And are not the good wise?",
    "HERMOGENES: Yes, they are wise.",
    "SOCRATES: And therefore I have the most entire conviction that he\ncalled them demons, because they were daemones (knowing or wise), and\nin our older Attic dialect the word itself occurs. Now he and other\npoets say truly, that when a good man dies he has honour and a mighty\nportion among the dead, and becomes a demon; which is a name given to\nhim signifying wisdom. And I say too, that every wise man who happens\nto be a good man is more than human (daimonion) both in life and death,\nand is rightly called a demon.",
    "HERMOGENES: Then I rather think that I am of one mind with you; but\nwhat is the meaning of the word “hero”? (Eros with an eta, in the old\nwriting eros with an epsilon.)",
    "SOCRATES: I think that there is no difficulty in explaining, for the\nname is not much altered, and signifies that they were born of love.",
    "HERMOGENES: What do you mean?",
    "SOCRATES: Do you not know that the heroes are demigods?",
    "HERMOGENES: What then?",
    "SOCRATES: All of them sprang either from the love of a God for a mortal\nwoman, or of a mortal man for a Goddess; think of the word in the old\nAttic, and you will see better that the name heros is only a slight\nalteration of Eros, from whom the heroes sprang: either this is the\nmeaning, or, if not this, then they must have been skilful as\nrhetoricians and dialecticians, and able to put the question (erotan),\nfor eirein is equivalent to legein. And therefore, as I was saying, in\nthe Attic dialect the heroes turn out to be rhetoricians and\nquestioners. All this is easy enough; the noble breed of heroes are a\ntribe of sophists and rhetors. But can you tell me why men are called\nanthropoi?—that is more difficult.",
    "HERMOGENES: No, I cannot; and I would not try even if I could, because\nI think that you are the more likely to succeed.",
    "SOCRATES: That is to say, you trust to the inspiration of Euthyphro.",
    "HERMOGENES: Of course.",
    "SOCRATES: Your faith is not vain; for at this very moment a new and\ningenious thought strikes me, and, if I am not careful, before\nto-morrow’s dawn I shall be wiser than I ought to be. Now, attend to\nme; and first, remember that we often put in and pull out letters in\nwords, and give names as we please and change the accents. Take, for\nexample, the word Dii Philos; in order to convert this from a sentence\ninto a noun, we omit one of the iotas and sound the middle syllable\ngrave instead of acute; as, on the other hand, letters are sometimes\ninserted in words instead of being omitted, and the acute takes the\nplace of the grave.",
    "HERMOGENES: That is true.",
    "SOCRATES: The name anthropos, which was once a sentence, and is now a\nnoun, appears to be a case just of this sort, for one letter, which is\nthe alpha, has been omitted, and the acute on the last syllable has\nbeen changed to a grave.",
    "HERMOGENES: What do you mean?",
    "SOCRATES: I mean to say that the word “man” implies that other animals\nnever examine, or consider, or look up at what they see, but that man\nnot only sees (opope) but considers and looks up at that which he sees,\nand hence he alone of all animals is rightly anthropos, meaning\nanathron a opopen.",
    "HERMOGENES: May I ask you to examine another word about which I am\ncurious?",
    "SOCRATES: Certainly.",
    "HERMOGENES: I will take that which appears to me to follow next in\norder. You know the distinction of soul and body?",
    "SOCRATES: Of course.",
    "HERMOGENES: Let us endeavour to analyze them like the previous words.",
    "SOCRATES: You want me first of all to examine the natural fitness of\nthe word psuche (soul), and then of the word soma (body)?",
    "HERMOGENES: Yes.",
    "SOCRATES: If I am to say what occurs to me at the moment, I should\nimagine that those who first used the name psuche meant to express that\nthe soul when in the body is the source of life, and gives the power of\nbreath and revival (anapsuchon), and when this reviving power fails\nthen the body perishes and dies, and this, if I am not mistaken, they\ncalled psyche. But please stay a moment; I fancy that I can discover\nsomething which will be more acceptable to the disciples of Euthyphro,\nfor I am afraid that they will scorn this explanation. What do you say\nto another?",
    "HERMOGENES: Let me hear.",
    "SOCRATES: What is that which holds and carries and gives life and\nmotion to the entire nature of the body? What else but the soul?",
    "HERMOGENES: Just that.",
    "SOCRATES: And do you not believe with Anaxagoras, that mind or soul is\nthe ordering and containing principle of all things?",
    "HERMOGENES: Yes; I do.",
    "SOCRATES: Then you may well call that power phuseche which carries and\nholds nature (e phusin okei, kai ekei), and this may be refined away\ninto psuche.",
    "HERMOGENES: Certainly; and this derivation is, I think, more scientific\nthan the other.",
    "SOCRATES: It is so; but I cannot help laughing, if I am to suppose that\nthis was the true meaning of the name.",
    "HERMOGENES: But what shall we say of the next word?",
    "SOCRATES: You mean soma (the body).",
    "HERMOGENES: Yes.",
    "SOCRATES: That may be variously interpreted; and yet more variously if\na little permutation is allowed. For some say that the body is the\ngrave (sema) of the soul which may be thought to be buried in our\npresent life; or again the index of the soul, because the soul gives\nindications to (semainei) the body; probably the Orphic poets were the\ninventors of the name, and they were under the impression that the soul\nis suffering the punishment of sin, and that the body is an enclosure\nor prison in which the soul is incarcerated, kept safe (soma, sozetai),\nas the name soma implies, until the penalty is paid; according to this\nview, not even a letter of the word need be changed.",
    "HERMOGENES: I think, Socrates, that we have said enough of this class\nof words. But have we any more explanations of the names of the Gods,\nlike that which you were giving of Zeus? I should like to know whether\nany similar principle of correctness is to be applied to them.",
    "SOCRATES: Yes, indeed, Hermogenes; and there is one excellent principle\nwhich, as men of sense, we must acknowledge,—that of the Gods we know\nnothing, either of their natures or of the names which they give\nthemselves; but we are sure that the names by which they call\nthemselves, whatever they may be, are true. And this is the best of all\nprinciples; and the next best is to say, as in prayers, that we will\ncall them by any sort or kind of names or patronymics which they like,\nbecause we do not know of any other. That also, I think, is a very good\ncustom, and one which I should much wish to observe. Let us, then, if\nyou please, in the first place announce to them that we are not\nenquiring about them; we do not presume that we are able to do so; but\nwe are enquiring about the meaning of men in giving them these\nnames,—in this there can be small blame.",
    "HERMOGENES: I think, Socrates, that you are quite right, and I would\nlike to do as you say.",
    "SOCRATES: Shall we begin, then, with Hestia, according to custom?",
    "HERMOGENES: Yes, that will be very proper.",
    "SOCRATES: What may we suppose him to have meant who gave the name\nHestia?",
    "HERMOGENES: That is another and certainly a most difficult question.",
    "SOCRATES: My dear Hermogenes, the first imposers of names must surely\nhave been considerable persons; they were philosophers, and had a good\ndeal to say.",
    "HERMOGENES: Well, and what of them?",
    "SOCRATES: They are the men to whom I should attribute the imposition of\nnames. Even in foreign names, if you analyze them, a meaning is still\ndiscernible. For example, that which we term ousia is by some called\nesia, and by others again osia. Now that the essence of things should\nbe called estia, which is akin to the first of these (esia = estia), is\nrational enough. And there is reason in the Athenians calling that\nestia which participates in ousia. For in ancient times we too seem to\nhave said esia for ousia, and this you may note to have been the idea\nof those who appointed that sacrifices should be first offered to\nestia, which was natural enough if they meant that estia was the\nessence of things. Those again who read osia seem to have inclined to\nthe opinion of Heracleitus, that all things flow and nothing stands;\nwith them the pushing principle (othoun) is the cause and ruling power\nof all things, and is therefore rightly called osia. Enough of this,\nwhich is all that we who know nothing can affirm. Next in order after\nHestia we ought to consider Rhea and Cronos, although the name of\nCronos has been already discussed. But I dare say that I am talking\ngreat nonsense.",
    "HERMOGENES: Why, Socrates?",
    "SOCRATES: My good friend, I have discovered a hive of wisdom.",
    "HERMOGENES: Of what nature?",
    "SOCRATES: Well, rather ridiculous, and yet plausible.",
    "HERMOGENES: How plausible?",
    "SOCRATES: I fancy to myself Heracleitus repeating wise traditions of\nantiquity as old as the days of Cronos and Rhea, and of which Homer\nalso spoke.",
    "HERMOGENES: How do you mean?",
    "SOCRATES: Heracleitus is supposed to say that all things are in motion\nand nothing at rest; he compares them to the stream of a river, and\nsays that you cannot go into the same water twice.",
    "HERMOGENES: That is true.",
    "SOCRATES: Well, then, how can we avoid inferring that he who gave the\nnames of Cronos and Rhea to the ancestors of the Gods, agreed pretty\nmuch in the doctrine of Heracleitus? Is the giving of the names of\nstreams to both of them purely accidental? Compare the line in which\nHomer, and, as I believe, Hesiod also, tells of",
    "“Ocean, the origin of Gods, and mother Tethys (Il.—the line is not\nfound in the extant works of Hesiod.).”",
    "And again, Orpheus says, that",
    "“The fair river of Ocean was the first to marry, and he espoused his\nsister Tethys, who was his mother’s daughter.”",
    "You see that this is a remarkable coincidence, and all in the direction\nof Heracleitus.",
    "HERMOGENES: I think that there is something in what you say, Socrates;\nbut I do not understand the meaning of the name Tethys.",
    "SOCRATES: Well, that is almost self-explained, being only the name of a\nspring, a little disguised; for that which is strained and filtered\n(diattomenon, ethoumenon) may be likened to a spring, and the name\nTethys is made up of these two words.",
    "HERMOGENES: The idea is ingenious, Socrates.",
    "SOCRATES: To be sure. But what comes next?—of Zeus we have spoken.",
    "HERMOGENES: Yes.",
    "SOCRATES: Then let us next take his two brothers, Poseidon and Pluto,\nwhether the latter is called by that or by his other name.",
    "HERMOGENES: By all means.",
    "SOCRATES: Poseidon is Posidesmos, the chain of the feet; the original\ninventor of the name had been stopped by the watery element in his\nwalks, and not allowed to go on, and therefore he called the ruler of\nthis element Poseidon; the epsilon was probably inserted as an\nornament. Yet, perhaps, not so; but the name may have been originally\nwritten with a double lamda and not with a sigma, meaning that the God\nknew many things (Polla eidos). And perhaps also he being the shaker of\nthe earth, has been named from shaking (seiein), and then pi and delta\nhave been added. Pluto gives wealth (Ploutos), and his name means the\ngiver of wealth, which comes out of the earth beneath. People in\ngeneral appear to imagine that the term Hades is connected with the\ninvisible (aeides) and so they are led by their fears to call the God\nPluto instead.",
    "HERMOGENES: And what is the true derivation?",
    "SOCRATES: In spite of the mistakes which are made about the power of\nthis deity, and the foolish fears which people have of him, such as the\nfear of always being with him after death, and of the soul denuded of\nthe body going to him (compare Rep.), my belief is that all is quite\nconsistent, and that the office and name of the God really correspond.",
    "HERMOGENES: Why, how is that?",
    "SOCRATES: I will tell you my own opinion; but first, I should like to\nask you which chain does any animal feel to be the stronger? and which\nconfines him more to the same spot,—desire or necessity?",
    "HERMOGENES: Desire, Socrates, is stronger far.",
    "SOCRATES: And do you not think that many a one would escape from Hades,\nif he did not bind those who depart to him by the strongest of chains?",
    "HERMOGENES: Assuredly they would.",
    "SOCRATES: And if by the greatest of chains, then by some desire, as I\nshould certainly infer, and not by necessity?",
    "HERMOGENES: That is clear.",
    "SOCRATES: And there are many desires?",
    "HERMOGENES: Yes.",
    "SOCRATES: And therefore by the greatest desire, if the chain is to be\nthe greatest?",
    "HERMOGENES: Yes.",
    "SOCRATES: And is any desire stronger than the thought that you will be\nmade better by associating with another?",
    "HERMOGENES: Certainly not.",
    "SOCRATES: And is not that the reason, Hermogenes, why no one, who has\nbeen to him, is willing to come back to us? Even the Sirens, like all\nthe rest of the world, have been laid under his spells. Such a charm,\nas I imagine, is the God able to infuse into his words. And, according\nto this view, he is the perfect and accomplished Sophist, and the great\nbenefactor of the inhabitants of the other world; and even to us who\nare upon earth he sends from below exceeding blessings. For he has much\nmore than he wants down there; wherefore he is called Pluto (or the\nrich). Note also, that he will have nothing to do with men while they\nare in the body, but only when the soul is liberated from the desires\nand evils of the body. Now there is a great deal of philosophy and\nreflection in that; for in their liberated state he can bind them with\nthe desire of virtue, but while they are flustered and maddened by the\nbody, not even father Cronos himself would suffice to keep them with\nhim in his own far-famed chains.",
    "HERMOGENES: There is a deal of truth in what you say.",
    "SOCRATES: Yes, Hermogenes, and the legislator called him Hades, not\nfrom the unseen (aeides)—far otherwise, but from his knowledge\n(eidenai) of all noble things.",
    "HERMOGENES: Very good; and what do we say of Demeter, and Here, and\nApollo, and Athene, and Hephaestus, and Ares, and the other deities?",
    "SOCRATES: Demeter is e didousa meter, who gives food like a mother;\nHere is the lovely one (erate)—for Zeus, according to tradition, loved\nand married her; possibly also the name may have been given when the\nlegislator was thinking of the heavens, and may be only a disguise of\nthe air (aer), putting the end in the place of the beginning. You will\nrecognize the truth of this if you repeat the letters of Here several\ntimes over. People dread the name of Pherephatta as they dread the name\nof Apollo,—and with as little reason; the fear, if I am not mistaken,\nonly arises from their ignorance of the nature of names. But they go\nchanging the name into Phersephone, and they are terrified at this;\nwhereas the new name means only that the Goddess is wise (sophe); for\nseeing that all things in the world are in motion (pheromenon), that\nprinciple which embraces and touches and is able to follow them, is\nwisdom. And therefore the Goddess may be truly called Pherepaphe\n(Pherepapha), or some name like it, because she touches that which is\nin motion (tou pheromenon ephaptomene), herein showing her wisdom. And\nHades, who is wise, consorts with her, because she is wise. They alter\nher name into Pherephatta now-a-days, because the present generation\ncare for euphony more than truth. There is the other name, Apollo,\nwhich, as I was saying, is generally supposed to have some terrible\nsignification. Have you remarked this fact?",
    "HERMOGENES: To be sure I have, and what you say is true.",
    "SOCRATES: But the name, in my opinion, is really most expressive of the\npower of the God.",
    "HERMOGENES: How so?",
    "SOCRATES: I will endeavour to explain, for I do not believe that any\nsingle name could have been better adapted to express the attributes of\nthe God, embracing and in a manner signifying all four of them,—music,\nand prophecy, and medicine, and archery.",
    "HERMOGENES: That must be a strange name, and I should like to hear the\nexplanation.",
    "SOCRATES: Say rather an harmonious name, as beseems the God of Harmony.\nIn the first place, the purgations and purifications which doctors and\ndiviners use, and their fumigations with drugs magical or medicinal, as\nwell as their washings and lustral sprinklings, have all one and the\nsame object, which is to make a man pure both in body and soul.",
    "HERMOGENES: Very true.",
    "SOCRATES: And is not Apollo the purifier, and the washer, and the\nabsolver from all impurities?",
    "HERMOGENES: Very true.",
    "SOCRATES: Then in reference to his ablutions and absolutions, as being\nthe physician who orders them, he may be rightly called Apolouon\n(purifier); or in respect of his powers of divination, and his truth\nand sincerity, which is the same as truth, he may be most fitly called\nAplos, from aplous (sincere), as in the Thessalian dialect, for all the\nThessalians call him Aplos; also he is aei Ballon (always shooting),\nbecause he is a master archer who never misses; or again, the name may\nrefer to his musical attributes, and then, as in akolouthos, and\nakoitis, and in many other words the alpha is supposed to mean\n“together,” so the meaning of the name Apollo will be “moving\ntogether,” whether in the poles of heaven as they are called, or in the\nharmony of song, which is termed concord, because he moves all together\nby an harmonious power, as astronomers and musicians ingeniously\ndeclare. And he is the God who presides over harmony, and makes all\nthings move together, both among Gods and among men. And as in the\nwords akolouthos and akoitis the alpha is substituted for an omicron,\nso the name Apollon is equivalent to omopolon; only the second lambda\nis added in order to avoid the ill-omened sound of destruction\n(apolon). Now the suspicion of this destructive power still haunts the\nminds of some who do not consider the true value of the name, which, as\nI was saying just now, has reference to all the powers of the God, who\nis the single one, the everdarting, the purifier, the mover together\n(aplous, aei Ballon, apolouon, omopolon). The name of the Muses and of\nmusic would seem to be derived from their making philosophical\nenquiries (mosthai); and Leto is called by this name, because she is\nsuch a gentle Goddess, and so willing (ethelemon) to grant our\nrequests; or her name may be Letho, as she is often called by\nstrangers—they seem to imply by it her amiability, and her smooth and\neasy-going way of behaving. Artemis is named from her healthy\n(artemes), well-ordered nature, and because of her love of virginity,\nperhaps because she is a proficient in virtue (arete), and perhaps also\nas hating intercourse of the sexes (ton aroton misesasa). He who gave\nthe Goddess her name may have had any or all of these reasons.",
    "HERMOGENES: What is the meaning of Dionysus and Aphrodite?",
    "SOCRATES: Son of Hipponicus, you ask a solemn question; there is a\nserious and also a facetious explanation of both these names; the\nserious explanation is not to be had from me, but there is no objection\nto your hearing the facetious one; for the Gods too love a joke.\nDionusos is simply didous oinon (giver of wine), Didoinusos, as he\nmight be called in fun,—and oinos is properly oionous, because wine\nmakes those who drink, think (oiesthai) that they have a mind (noun)\nwhen they have none. The derivation of Aphrodite, born of the foam\n(aphros), may be fairly accepted on the authority of Hesiod.",
    "HERMOGENES: Still there remains Athene, whom you, Socrates, as an\nAthenian, will surely not forget; there are also Hephaestus and Ares.",
    "SOCRATES: I am not likely to forget them.",
    "HERMOGENES: No, indeed.",
    "SOCRATES: There is no difficulty in explaining the other appellation of\nAthene.",
    "HERMOGENES: What other appellation?",
    "SOCRATES: We call her Pallas.",
    "HERMOGENES: To be sure.",
    "SOCRATES: And we cannot be wrong in supposing that this is derived from\narmed dances. For the elevation of oneself or anything else above the\nearth, or by the use of the hands, we call shaking (pallein), or\ndancing.",
    "HERMOGENES: That is quite true.",
    "SOCRATES: Then that is the explanation of the name Pallas?",
    "HERMOGENES: Yes; but what do you say of the other name?",
    "SOCRATES: Athene?",
    "HERMOGENES: Yes.",
    "SOCRATES: That is a graver matter, and there, my friend, the modern\ninterpreters of Homer may, I think, assist in explaining the view of\nthe ancients. For most of these in their explanations of the poet,\nassert that he meant by Athene “mind” (nous) and “intelligence”\n(dianoia), and the maker of names appears to have had a singular notion\nabout her; and indeed calls her by a still higher title, “divine\nintelligence” (Thou noesis), as though he would say: This is she who\nhas the mind of God (Theonoa);—using alpha as a dialectical variety for\neta, and taking away iota and sigma (There seems to be some error in\nthe MSS. The meaning is that the word theonoa = theounoa is a curtailed\nform of theou noesis, but the omitted letters do not agree.). Perhaps,\nhowever, the name Theonoe may mean “she who knows divine things” (Theia\nnoousa) better than others. Nor shall we be far wrong in supposing that\nthe author of it wished to identify this Goddess with moral\nintelligence (en ethei noesin), and therefore gave her the name\nethonoe; which, however, either he or his successors have altered into\nwhat they thought a nicer form, and called her Athene.",
    "HERMOGENES: But what do you say of Hephaestus?",
    "SOCRATES: Speak you of the princely lord of light (Phaeos istora)?",
    "HERMOGENES: Surely.",
    "SOCRATES: Ephaistos is Phaistos, and has added the eta by attraction;\nthat is obvious to anybody.",
    "HERMOGENES: That is very probable, until some more probable notion gets\ninto your head.",
    "SOCRATES: To prevent that, you had better ask what is the derivation of\nAres.",
    "HERMOGENES: What is Ares?",
    "SOCRATES: Ares may be called, if you will, from his manhood (arren) and\nmanliness, or if you please, from his hard and unchangeable nature,\nwhich is the meaning of arratos: the latter is a derivation in every\nway appropriate to the God of war.",
    "HERMOGENES: Very true.",
    "SOCRATES: And now, by the Gods, let us have no more of the Gods, for I\nam afraid of them; ask about anything but them, and thou shalt see how\nthe steeds of Euthyphro can prance.",
    "HERMOGENES: Only one more God! I should like to know about Hermes, of\nwhom I am said not to be a true son. Let us make him out, and then I\nshall know whether there is any meaning in what Cratylus says.",
    "SOCRATES: I should imagine that the name Hermes has to do with speech,\nand signifies that he is the interpreter (ermeneus), or messenger, or\nthief, or liar, or bargainer; all that sort of thing has a great deal\nto do with language; as I was telling you, the word eirein is\nexpressive of the use of speech, and there is an often-recurring\nHomeric word emesato, which means “he contrived”—out of these two\nwords, eirein and mesasthai, the legislator formed the name of the God\nwho invented language and speech; and we may imagine him dictating to\nus the use of this name: “O my friends,” says he to us, “seeing that he\nis the contriver of tales or speeches, you may rightly call him\nEirhemes.” And this has been improved by us, as we think, into Hermes.\nIris also appears to have been called from the verb “to tell” (eirein),\nbecause she was a messenger.",
    "HERMOGENES: Then I am very sure that Cratylus was quite right in saying\nthat I was no true son of Hermes (Ermogenes), for I am not a good hand\nat speeches.",
    "SOCRATES: There is also reason, my friend, in Pan being the\ndouble-formed son of Hermes.",
    "HERMOGENES: How do you make that out?",
    "SOCRATES: You are aware that speech signifies all things (pan), and is\nalways turning them round and round, and has two forms, true and false?",
    "HERMOGENES: Certainly.",
    "SOCRATES: Is not the truth that is in him the smooth or sacred form\nwhich dwells above among the Gods, whereas falsehood dwells among men\nbelow, and is rough like the goat of tragedy; for tales and falsehoods\nhave generally to do with the tragic or goatish life, and tragedy is\nthe place of them?",
    "HERMOGENES: Very true.",
    "SOCRATES: Then surely Pan, who is the declarer of all things (pan) and\nthe perpetual mover (aei polon) of all things, is rightly called\naipolos (goat-herd), he being the two-formed son of Hermes, smooth in\nhis upper part, and rough and goatlike in his lower regions. And, as\nthe son of Hermes, he is speech or the brother of speech, and that\nbrother should be like brother is no marvel. But, as I was saying, my\ndear Hermogenes, let us get away from the Gods.",
    "HERMOGENES: From these sort of Gods, by all means, Socrates. But why\nshould we not discuss another kind of Gods—the sun, moon, stars, earth,\naether, air, fire, water, the seasons, and the year?",
    "SOCRATES: You impose a great many tasks upon me. Still, if you wish, I\nwill not refuse.",
    "HERMOGENES: You will oblige me.",
    "SOCRATES: How would you have me begin? Shall I take first of all him\nwhom you mentioned first—the sun?",
    "HERMOGENES: Very good.",
    "SOCRATES: The origin of the sun will probably be clearer in the Doric\nform, for the Dorians call him alios, and this name is given to him\nbecause when he rises he gathers (alizoi) men together or because he is\nalways rolling in his course (aei eilein ion) about the earth; or from\naiolein, of which the meaning is the same as poikillein (to variegate),\nbecause he variegates the productions of the earth.",
    "HERMOGENES: But what is selene (the moon)?",
    "SOCRATES: That name is rather unfortunate for Anaxagoras.",
    "HERMOGENES: How so?",
    "SOCRATES: The word seems to forestall his recent discovery, that the\nmoon receives her light from the sun.",
    "HERMOGENES: Why do you say so?",
    "SOCRATES: The two words selas (brightness) and phos (light) have much\nthe same meaning?",
    "HERMOGENES: Yes.",
    "SOCRATES: This light about the moon is always new (neon) and always old\n(enon), if the disciples of Anaxagoras say truly. For the sun in his\nrevolution always adds new light, and there is the old light of the\nprevious month.",
    "HERMOGENES: Very true.",
    "SOCRATES: The moon is not unfrequently called selanaia.",
    "HERMOGENES: True.",
    "SOCRATES: And as she has a light which is always old and always new\n(enon neon aei) she may very properly have the name selaenoneoaeia; and\nthis when hammered into shape becomes selanaia.",
    "HERMOGENES: A real dithyrambic sort of name that, Socrates. But what do\nyou say of the month and the stars?",
    "SOCRATES: Meis (month) is called from meiousthai (to lessen), because\nsuffering diminution; the name of astra (stars) seems to be derived\nfrom astrape, which is an improvement on anastrope, signifying the\nupsetting of the eyes (anastrephein opa).",
    "HERMOGENES: What do you say of pur (fire) and udor (water)?",
    "SOCRATES: I am at a loss how to explain pur; either the muse of\nEuthyphro has deserted me, or there is some very great difficulty in\nthe word. Please, however, to note the contrivance which I adopt\nwhenever I am in a difficulty of this sort.",
    "HERMOGENES: What is it?",
    "SOCRATES: I will tell you; but I should like to know first whether you\ncan tell me what is the meaning of the pur?",
    "HERMOGENES: Indeed I cannot.",
    "SOCRATES: Shall I tell you what I suspect to be the true explanation of\nthis and several other words?—My belief is that they are of foreign\norigin. For the Hellenes, especially those who were under the dominion\nof the barbarians, often borrowed from them.",
    "HERMOGENES: What is the inference?",
    "SOCRATES: Why, you know that any one who seeks to demonstrate the\nfitness of these names according to the Hellenic language, and not\naccording to the language from which the words are derived, is rather\nlikely to be at fault.",
    "HERMOGENES: Yes, certainly.",
    "SOCRATES: Well then, consider whether this pur is not foreign; for the\nword is not easily brought into relation with the Hellenic tongue, and\nthe Phrygians may be observed to have the same word slightly changed,\njust as they have udor (water) and kunes (dogs), and many other words.",
    "HERMOGENES: That is true.",
    "SOCRATES: Any violent interpretations of the words should be avoided;\nfor something to say about them may easily be found. And thus I get rid\nof pur and udor. Aer (air), Hermogenes, may be explained as the element\nwhich raises (airei) things from the earth, or as ever flowing (aei\nrei), or because the flux of the air is wind, and the poets call the\nwinds “air-blasts,” (aetai); he who uses the term may mean, so to\nspeak, air-flux (aetorroun), in the sense of wind-flux (pneumatorroun);\nand because this moving wind may be expressed by either term he employs\nthe word air (aer = aetes rheo). Aither (aether) I should interpret as\naeitheer; this may be correctly said, because this element is always\nrunning in a flux about the air (aei thei peri tou aera reon). The\nmeaning of the word ge (earth) comes out better when in the form of\ngaia, for the earth may be truly called “mother” (gaia, genneteira), as\nin the language of Homer (Od.) gegaasi means gegennesthai.",
    "HERMOGENES: Good.",
    "SOCRATES: What shall we take next?",
    "HERMOGENES: There are orai (the seasons), and the two names of the\nyear, eniautos and etos.",
    "SOCRATES: The orai should be spelt in the old Attic way, if you desire\nto know the probable truth about them; they are rightly called the orai\nbecause they divide (orizousin) the summers and winters and winds and\nthe fruits of the earth. The words eniautos and etos appear to be the\nsame,—“that which brings to light the plants and growths of the earth\nin their turn, and passes them in review within itself (en eauto\nexetazei)”: this is broken up into two words, eniautos from en eauto,\nand etos from etazei, just as the original name of Zeus was divided\ninto Zena and Dia; and the whole proposition means that his power of\nreviewing from within is one, but has two names, two words etos and\neniautos being thus formed out of a single proposition.",
    "HERMOGENES: Indeed, Socrates, you make surprising progress.",
    "SOCRATES: I am run away with.",
    "HERMOGENES: Very true.",
    "SOCRATES: But am not yet at my utmost speed.",
    "HERMOGENES: I should like very much to know, in the next place, how you\nwould explain the virtues. What principle of correctness is there in\nthose charming words—wisdom, understanding, justice, and the rest of\nthem?",
    "SOCRATES: That is a tremendous class of names which you are\ndisinterring; still, as I have put on the lion’s skin, I must not be\nfaint of heart; and I suppose that I must consider the meaning of\nwisdom (phronesis) and understanding (sunesis), and judgment (gnome),\nand knowledge (episteme), and all those other charming words, as you\ncall them?",
    "HERMOGENES: Surely, we must not leave off until we find out their\nmeaning.",
    "SOCRATES: By the dog of Egypt I have a not bad notion which came into\nmy head only this moment: I believe that the primeval givers of names\nwere undoubtedly like too many of our modern philosophers, who, in\ntheir search after the nature of things, are always getting dizzy from\nconstantly going round and round, and then they imagine that the world\nis going round and round and moving in all directions; and this\nappearance, which arises out of their own internal condition, they\nsuppose to be a reality of nature; they think that there is nothing\nstable or permanent, but only flux and motion, and that the world is\nalways full of every sort of motion and change. The consideration of\nthe names which I mentioned has led me into making this reflection.",
    "HERMOGENES: How is that, Socrates?",
    "SOCRATES: Perhaps you did not observe that in the names which have been\njust cited, the motion or flux or generation of things is most surely\nindicated.",
    "HERMOGENES: No, indeed, I never thought of it.",
    "SOCRATES: Take the first of those which you mentioned; clearly that is\na name indicative of motion.",
    "HERMOGENES: What was the name?",
    "SOCRATES: Phronesis (wisdom), which may signify phoras kai rhou noesis\n(perception of motion and flux), or perhaps phoras onesis (the blessing\nof motion), but is at any rate connected with pheresthai (motion);\ngnome (judgment), again, certainly implies the ponderation or\nconsideration (nomesis) of generation, for to ponder is the same as to\nconsider; or, if you would rather, here is noesis, the very word just\nnow mentioned, which is neou esis (the desire of the new); the word\nneos implies that the world is always in process of creation. The giver\nof the name wanted to express this longing of the soul, for the\noriginal name was neoesis, and not noesis; but eta took the place of a\ndouble epsilon. The word sophrosune is the salvation (soteria) of that\nwisdom (phronesis) which we were just now considering. Epioteme\n(knowledge) is akin to this, and indicates that the soul which is good\nfor anything follows (epetai) the motion of things, neither\nanticipating them nor falling behind them; wherefore the word should\nrather be read as epistemene, inserting epsilon nu. Sunesis\n(understanding) may be regarded in like manner as a kind of conclusion;\nthe word is derived from sunienai (to go along with), and, like\nepistasthai (to know), implies the progression of the soul in company\nwith the nature of things. Sophia (wisdom) is very dark, and appears\nnot to be of native growth; the meaning is, touching the motion or\nstream of things. You must remember that the poets, when they speak of\nthe commencement of any rapid motion, often use the word esuthe (he\nrushed); and there was a famous Lacedaemonian who was named Sous\n(Rush), for by this word the Lacedaemonians signify rapid motion, and\nthe touching (epaphe) of motion is expressed by sophia, for all things\nare supposed to be in motion. Good (agathon) is the name which is given\nto the admirable (agasto) in nature; for, although all things move,\nstill there are degrees of motion; some are swifter, some slower; but\nthere are some things which are admirable for their swiftness, and this\nadmirable part of nature is called agathon. Dikaiosune (justice) is\nclearly dikaiou sunesis (understanding of the just); but the actual\nword dikaion is more difficult: men are only agreed to a certain extent\nabout justice, and then they begin to disagree. For those who suppose\nall things to be in motion conceive the greater part of nature to be a\nmere receptacle; and they say that there is a penetrating power which\npasses through all this, and is the instrument of creation in all, and\nis the subtlest and swiftest element; for if it were not the subtlest,\nand a power which none can keep out, and also the swiftest, passing by\nother things as if they were standing still, it could not penetrate\nthrough the moving universe. And this element, which superintends all\nthings and pierces (diaion) all, is rightly called dikaion; the letter\nk is only added for the sake of euphony. Thus far, as I was saying,\nthere is a general agreement about the nature of justice; but I,\nHermogenes, being an enthusiastic disciple, have been told in a mystery\nthat the justice of which I am speaking is also the cause of the world:\nnow a cause is that because of which anything is created; and some one\ncomes and whispers in my ear that justice is rightly so called because\npartaking of the nature of the cause, and I begin, after hearing what\nhe has said, to interrogate him gently: “Well, my excellent friend,”\nsay I, “but if all this be true, I still want to know what is justice.”\nThereupon they think that I ask tiresome questions, and am leaping over\nthe barriers, and have been already sufficiently answered, and they try\nto satisfy me with one derivation after another, and at length they\nquarrel. For one of them says that justice is the sun, and that he only\nis the piercing (diaionta) and burning (kaonta) element which is the\nguardian of nature. And when I joyfully repeat this beautiful notion, I\nam answered by the satirical remark, “What, is there no justice in the\nworld when the sun is down?” And when I earnestly beg my questioner to\ntell me his own honest opinion, he says, “Fire in the abstract”; but\nthis is not very intelligible. Another says, “No, not fire in the\nabstract, but the abstraction of heat in the fire.” Another man\nprofesses to laugh at all this, and says, as Anaxagoras says, that\njustice is mind, for mind, as they say, has absolute power, and mixes\nwith nothing, and orders all things, and passes through all things. At\nlast, my friend, I find myself in far greater perplexity about the\nnature of justice than I was before I began to learn. But still I am of\nopinion that the name, which has led me into this digression, was given\nto justice for the reasons which I have mentioned.",
    "HERMOGENES: I think, Socrates, that you are not improvising now; you\nmust have heard this from some one else.",
    "SOCRATES: And not the rest?",
    "HERMOGENES: Hardly.",
    "SOCRATES: Well, then, let me go on in the hope of making you believe in\nthe originality of the rest. What remains after justice? I do not think\nthat we have as yet discussed courage (andreia),—injustice (adikia),\nwhich is obviously nothing more than a hindrance to the penetrating\nprinciple (diaiontos), need not be considered. Well, then, the name of\nandreia seems to imply a battle;—this battle is in the world of\nexistence, and according to the doctrine of flux is only the\ncounterflux (enantia rhon): if you extract the delta from andreia, the\nname at once signifies the thing, and you may clearly understand that\nandreia is not the stream opposed to every stream, but only to that\nwhich is contrary to justice, for otherwise courage would not have been\npraised. The words arren (male) and aner (man) also contain a similar\nallusion to the same principle of the upward flux (te ano rhon). Gune\n(woman) I suspect to be the same word as goun (birth): thelu (female)\nappears to be partly derived from thele (the teat), because the teat is\nlike rain, and makes things flourish (tethelenai).",
    "HERMOGENES: That is surely probable.",
    "SOCRATES: Yes; and the very word thallein (to flourish) seems to figure\nthe growth of youth, which is swift and sudden ever. And this is\nexpressed by the legislator in the name, which is a compound of thein\n(running), and allesthai (leaping). Pray observe how I gallop away when\nI get on smooth ground. There are a good many names generally thought\nto be of importance, which have still to be explained.",
    "HERMOGENES: True.",
    "SOCRATES: There is the meaning of the word techne (art), for example.",
    "HERMOGENES: Very true.",
    "SOCRATES: That may be identified with echonoe, and expresses the\npossession of mind: you have only to take away the tau and insert two\nomichrons, one between the chi and nu, and another between the nu and\neta.",
    "HERMOGENES: That is a very shabby etymology.",
    "SOCRATES: Yes, my dear friend; but then you know that the original\nnames have been long ago buried and disguised by people sticking on and\nstripping off letters for the sake of euphony, and twisting and\nbedizening them in all sorts of ways: and time too may have had a share\nin the change. Take, for example, the word katoptron; why is the letter\nrho inserted? This must surely be the addition of some one who cares\nnothing about the truth, but thinks only of putting the mouth into\nshape. And the additions are often such that at last no human being can\npossibly make out the original meaning of the word. Another example is\nthe word sphigx, sphiggos, which ought properly to be phigx, phiggos,\nand there are other examples.",
    "HERMOGENES: That is quite true, Socrates.",
    "SOCRATES: And yet, if you are permitted to put in and pull out any\nletters which you please, names will be too easily made, and any name\nmay be adapted to any object.",
    "HERMOGENES: True.",
    "SOCRATES: Yes, that is true. And therefore a wise dictator, like\nyourself, should observe the laws of moderation and probability.",
    "HERMOGENES: Such is my desire.",
    "SOCRATES: And mine, too, Hermogenes. But do not be too much of a\nprecisian, or “you will unnerve me of my strength (Iliad.).” When you\nhave allowed me to add mechane (contrivance) to techne (art) I shall be\nat the top of my bent, for I conceive mechane to be a sign of great\naccomplishment—anein; for mekos has the meaning of greatness, and these\ntwo, mekos and anein, make up the word mechane. But, as I was saying,\nbeing now at the top of my bent, I should like to consider the meaning\nof the two words arete (virtue) and kakia (vice); arete I do not as yet\nunderstand, but kakia is transparent, and agrees with the principles\nwhich preceded, for all things being in a flux (ionton), kakia is kakos\nion (going badly); and this evil motion when existing in the soul has\nthe general name of kakia, or vice, specially appropriated to it. The\nmeaning of kakos ienai may be further illustrated by the use of deilia\n(cowardice), which ought to have come after andreia, but was forgotten,\nand, as I fear, is not the only word which has been passed over. Deilia\nsignifies that the soul is bound with a strong chain (desmos), for lian\nmeans strength, and therefore deilia expresses the greatest and\nstrongest bond of the soul; and aporia (difficulty) is an evil of the\nsame nature (from a (alpha) not, and poreuesthai to go), like anything\nelse which is an impediment to motion and movement. Then the word kakia\nappears to mean kakos ienai, or going badly, or limping and halting; of\nwhich the consequence is, that the soul becomes filled with vice. And\nif kakia is the name of this sort of thing, arete will be the opposite\nof it, signifying in the first place ease of motion, then that the\nstream of the good soul is unimpeded, and has therefore the attribute\nof ever flowing without let or hindrance, and is therefore called\narete, or, more correctly, aeireite (ever-flowing), and may perhaps\nhave had another form, airete (eligible), indicating that nothing is\nmore eligible than virtue, and this has been hammered into arete. I\ndaresay that you will deem this to be another invention of mine, but I\nthink that if the previous word kakia was right, then arete is also\nright.",
    "HERMOGENES: But what is the meaning of kakon, which has played so great\na part in your previous discourse?",
    "SOCRATES: That is a very singular word about which I can hardly form an\nopinion, and therefore I must have recourse to my ingenious device.",
    "HERMOGENES: What device?",
    "SOCRATES: The device of a foreign origin, which I shall give to this\nword also.",
    "HERMOGENES: Very likely you are right; but suppose that we leave these\nwords and endeavour to see the rationale of kalon and aischron.",
    "SOCRATES: The meaning of aischron is evident, being only aei ischon\nroes (always preventing from flowing), and this is in accordance with\nour former derivations. For the name-giver was a great enemy to\nstagnation of all sorts, and hence he gave the name aeischoroun to that\nwhich hindered the flux (aei ischon roun), and that is now beaten\ntogether into aischron.",
    "HERMOGENES: But what do you say of kalon?",
    "SOCRATES: That is more obscure; yet the form is only due to the\nquantity, and has been changed by altering omicron upsilon into\nomicron.",
    "HERMOGENES: What do you mean?",
    "SOCRATES: This name appears to denote mind.",
    "HERMOGENES: How so?",
    "SOCRATES: Let me ask you what is the cause why anything has a name; is\nnot the principle which imposes the name the cause?",
    "HERMOGENES: Certainly.",
    "SOCRATES: And must not this be the mind of Gods, or of men, or of both?",
    "HERMOGENES: Yes.",
    "SOCRATES: Is not mind that which called (kalesan) things by their\nnames, and is not mind the beautiful (kalon)?",
    "HERMOGENES: That is evident.",
    "SOCRATES: And are not the works of intelligence and mind worthy of\npraise, and are not other works worthy of blame?",
    "HERMOGENES: Certainly.",
    "SOCRATES: Physic does the work of a physician, and carpentering does\nthe works of a carpenter?",
    "HERMOGENES: Exactly.",
    "SOCRATES: And the principle of beauty does the works of beauty?",
    "HERMOGENES: Of course.",
    "SOCRATES: And that principle we affirm to be mind?",
    "HERMOGENES: Very true.",
    "SOCRATES: Then mind is rightly called beauty because she does the works\nwhich we recognize and speak of as the beautiful?",
    "HERMOGENES: That is evident.",
    "SOCRATES: What more names remain to us?",
    "HERMOGENES: There are the words which are connected with agathon and\nkalon, such as sumpheron and lusiteloun, ophelimon, kerdaleon, and\ntheir opposites.",
    "SOCRATES: The meaning of sumpheron (expedient) I think that you may\ndiscover for yourself by the light of the previous examples,—for it is\na sister word to episteme, meaning just the motion (pora) of the soul\naccompanying the world, and things which are done upon this principle\nare called sumphora or sumpheronta, because they are carried round with\nthe world.",
    "HERMOGENES: That is probable.",
    "SOCRATES: Again, cherdaleon (gainful) is called from cherdos (gain),\nbut you must alter the delta into nu if you want to get at the meaning;\nfor this word also signifies good, but in another way; he who gave the\nname intended to express the power of admixture (kerannumenon) and\nuniversal penetration in the good; in forming the word, however, he\ninserted a delta instead of a nu, and so made kerdos.",
    "HERMOGENES: Well, but what is lusiteloun (profitable)?",
    "SOCRATES: I suppose, Hermogenes, that people do not mean by the\nprofitable the gainful or that which pays (luei) the retailer, but they\nuse the word in the sense of swift. You regard the profitable\n(lusiteloun), as that which being the swiftest thing in existence,\nallows of no stay in things and no pause or end of motion, but always,\nif there begins to be any end, lets things go again (luei), and makes\nmotion immortal and unceasing: and in this point of view, as appears to\nme, the good is happily denominated lusiteloun—being that which looses\n(luon) the end (telos) of motion. Ophelimon (the advantageous) is\nderived from ophellein, meaning that which creates and increases; this\nlatter is a common Homeric word, and has a foreign character.",
    "HERMOGENES: And what do you say of their opposites?",
    "SOCRATES: Of such as are mere negatives I hardly think that I need\nspeak.",
    "HERMOGENES: Which are they?",
    "SOCRATES: The words axumphoron (inexpedient), anopheles (unprofitable),\nalusiteles (unadvantageous), akerdes (ungainful).",
    "HERMOGENES: True.",
    "SOCRATES: I would rather take the words blaberon (harmful), zemiodes\n(hurtful).",
    "HERMOGENES: Good.",
    "SOCRATES: The word blaberon is that which is said to hinder or harm\n(blaptein) the stream (roun); blapton is boulomenon aptein (seeking to\nhold or bind); for aptein is the same as dein, and dein is always a\nterm of censure; boulomenon aptein roun (wanting to bind the stream)\nwould properly be boulapteroun, and this, as I imagine, is improved\ninto blaberon.",
    "HERMOGENES: You bring out curious results, Socrates, in the use of\nnames; and when I hear the word boulapteroun I cannot help imagining\nthat you are making your mouth into a flute, and puffing away at some\nprelude to Athene.",
    "SOCRATES: That is the fault of the makers of the name, Hermogenes; not\nmine.",
    "HERMOGENES: Very true; but what is the derivation of zemiodes?",
    "SOCRATES: What is the meaning of zemiodes?—let me remark, Hermogenes,\nhow right I was in saying that great changes are made in the meaning of\nwords by putting in and pulling out letters; even a very slight\npermutation will sometimes give an entirely opposite sense; I may\ninstance the word deon, which occurs to me at the moment, and reminds\nme of what I was going to say to you, that the fine fashionable\nlanguage of modern times has twisted and disguised and entirely altered\nthe original meaning both of deon, and also of zemiodes, which in the\nold language is clearly indicated.",
    "HERMOGENES: What do you mean?",
    "SOCRATES: I will try to explain. You are aware that our forefathers\nloved the sounds iota and delta, especially the women, who are most\nconservative of the ancient language, but now they change iota into eta\nor epsilon, and delta into zeta; this is supposed to increase the\ngrandeur of the sound.",
    "HERMOGENES: How do you mean?",
    "SOCRATES: For example, in very ancient times they called the day either\nimera or emera (short e), which is called by us emera (long e).",
    "HERMOGENES: That is true.",
    "SOCRATES: Do you observe that only the ancient form shows the intention\nof the giver of the name? of which the reason is, that men long for\n(imeirousi) and love the light which comes after the darkness, and is\ntherefore called imera, from imeros, desire.",
    "HERMOGENES: Clearly.",
    "SOCRATES: But now the name is so travestied that you cannot tell the\nmeaning, although there are some who imagine the day to be called emera\nbecause it makes things gentle (emera different accents).",
    "HERMOGENES: Such is my view.",
    "SOCRATES: And do you know that the ancients said duogon and not zugon?",
    "HERMOGENES: They did so.",
    "SOCRATES: And zugon (yoke) has no meaning,—it ought to be duogon, which\nword expresses the binding of two together (duein agoge) for the\npurpose of drawing;—this has been changed into zugon, and there are\nmany other examples of similar changes.",
    "HERMOGENES: There are.",
    "SOCRATES: Proceeding in the same train of thought I may remark that the\nword deon (obligation) has a meaning which is the opposite of all the\nother appellations of good; for deon is here a species of good, and is,\nnevertheless, the chain (desmos) or hinderer of motion, and therefore\nown brother of blaberon.",
    "HERMOGENES: Yes, Socrates; that is quite plain.",
    "SOCRATES: Not if you restore the ancient form, which is more likely to\nbe the correct one, and read dion instead of deon; if you convert the\nepsilon into an iota after the old fashion, this word will then agree\nwith other words meaning good; for dion, not deon, signifies the good,\nand is a term of praise; and the author of names has not contradicted\nhimself, but in all these various appellations, deon (obligatory),\nophelimon (advantageous), lusiteloun (profitable), kerdaleon (gainful),\nagathon (good), sumpheron (expedient), euporon (plenteous), the same\nconception is implied of the ordering or all-pervading principle which\nis praised, and the restraining and binding principle which is\ncensured. And this is further illustrated by the word zemiodes\n(hurtful), which if the zeta is only changed into delta as in the\nancient language, becomes demiodes; and this name, as you will\nperceive, is given to that which binds motion (dounti ion).",
    "HERMOGENES: What do you say of edone (pleasure), lupe (pain), epithumia\n(desire), and the like, Socrates?",
    "SOCRATES: I do not think, Hermogenes, that there is any great\ndifficulty about them—edone is e (eta) onesis, the action which tends\nto advantage; and the original form may be supposed to have been eone,\nbut this has been altered by the insertion of the delta. Lupe appears\nto be derived from the relaxation (luein) which the body feels when in\nsorrow; ania (trouble) is the hindrance of motion (alpha and ienai);\nalgedon (distress), if I am not mistaken, is a foreign word, which is\nderived from aleinos (grievous); odune (grief) is called from the\nputting on (endusis) sorrow; in achthedon (vexation) “the word too\nlabours,” as any one may see; chara (joy) is the very expression of the\nfluency and diffusion of the soul (cheo); terpsis (delight) is so\ncalled from the pleasure creeping (erpon) through the soul, which may\nbe likened to a breath (pnoe) and is properly erpnoun, but has been\naltered by time into terpnon; eupherosune (cheerfulness) and epithumia\nexplain themselves; the former, which ought to be eupherosune and has\nbeen changed euphrosune, is named, as every one may see, from the soul\nmoving (pheresthai) in harmony with nature; epithumia is really e epi\nton thumon iousa dunamis, the power which enters into the soul; thumos\n(passion) is called from the rushing (thuseos) and boiling of the soul;\nimeros (desire) denotes the stream (rous) which most draws the soul dia\nten esin tes roes—because flowing with desire (iemenos), and expresses\na longing after things and violent attraction of the soul to them, and\nis termed imeros from possessing this power; pothos (longing) is\nexpressive of the desire of that which is not present but absent, and\nin another place (pou); this is the reason why the name pothos is\napplied to things absent, as imeros is to things present; eros (love)\nis so called because flowing in (esron) from without; the stream is not\ninherent, but is an influence introduced through the eyes, and from\nflowing in was called esros (influx) in the old time when they used\nomicron for omega, and is called eros, now that omega is substituted\nfor omicron. But why do you not give me another word?",
    "HERMOGENES: What do you think of doxa (opinion), and that class of\nwords?",
    "SOCRATES: Doxa is either derived from dioxis (pursuit), and expresses\nthe march of the soul in the pursuit of knowledge, or from the shooting\nof a bow (toxon); the latter is more likely, and is confirmed by oiesis\n(thinking), which is only oisis (moving), and implies the movement of\nthe soul to the essential nature of each thing—just as boule (counsel)\nhas to do with shooting (bole); and boulesthai (to wish) combines the\nnotion of aiming and deliberating—all these words seem to follow doxa,\nand all involve the idea of shooting, just as aboulia, absence of\ncounsel, on the other hand, is a mishap, or missing, or mistaking of\nthe mark, or aim, or proposal, or object.",
    "HERMOGENES: You are quickening your pace now, Socrates.",
    "SOCRATES: Why yes, the end I now dedicate to God, not, however, until I\nhave explained anagke (necessity), which ought to come next, and\nekousion (the voluntary). Ekousion is certainly the yielding (eikon)\nand unresisting—the notion implied is yielding and not opposing,\nyielding, as I was just now saying, to that motion which is in\naccordance with our will; but the necessary and resistant being\ncontrary to our will, implies error and ignorance; the idea is taken\nfrom walking through a ravine which is impassable, and rugged, and\novergrown, and impedes motion—and this is the derivation of the word\nanagkaion (necessary) an agke ion, going through a ravine. But while my\nstrength lasts let us persevere, and I hope that you will persevere\nwith your questions.",
    "HERMOGENES: Well, then, let me ask about the greatest and noblest, such\nas aletheia (truth) and pseudos (falsehood) and on (being), not\nforgetting to enquire why the word onoma (name), which is the theme of\nour discussion, has this name of onoma.",
    "SOCRATES: You know the word maiesthai (to seek)?",
    "HERMOGENES: Yes;—meaning the same as zetein (to enquire).",
    "SOCRATES: The word onoma seems to be a compressed sentence, signifying\non ou zetema (being for which there is a search); as is still more\nobvious in onomaston (notable), which states in so many words that real\nexistence is that for which there is a seeking (on ou masma); aletheia\nis also an agglomeration of theia ale (divine wandering), implying the\ndivine motion of existence; pseudos (falsehood) is the opposite of\nmotion; here is another ill name given by the legislator to stagnation\nand forced inaction, which he compares to sleep (eudein); but the\noriginal meaning of the word is disguised by the addition of psi; on\nand ousia are ion with an iota broken off; this agrees with the true\nprinciple, for being (on) is also moving (ion), and the same may be\nsaid of not being, which is likewise called not going (oukion or ouki\non = ouk ion).",
    "HERMOGENES: You have hammered away at them manfully; but suppose that\nsome one were to say to you, what is the word ion, and what are reon\nand doun?—show me their fitness.",
    "SOCRATES: You mean to say, how should I answer him?",
    "HERMOGENES: Yes.",
    "SOCRATES: One way of giving the appearance of an answer has been\nalready suggested.",
    "HERMOGENES: What way?",
    "SOCRATES: To say that names which we do not understand are of foreign\norigin; and this is very likely the right answer, and something of this\nkind may be true of them; but also the original forms of words may have\nbeen lost in the lapse of ages; names have been so twisted in all\nmanner of ways, that I should not be surprised if the old language when\ncompared with that now in use would appear to us to be a barbarous\ntongue.",
    "HERMOGENES: Very likely.",
    "SOCRATES: Yes, very likely. But still the enquiry demands our earnest\nattention and we must not flinch. For we should remember, that if a\nperson go on analysing names into words, and enquiring also into the\nelements out of which the words are formed, and keeps on always\nrepeating this process, he who has to answer him must at last give up\nthe enquiry in despair.",
    "HERMOGENES: Very true.",
    "SOCRATES: And at what point ought he to lose heart and give up the\nenquiry? Must he not stop when he comes to the names which are the\nelements of all other names and sentences; for these cannot be supposed\nto be made up of other names? The word agathon (good), for example, is,\nas we were saying, a compound of agastos (admirable) and thoos (swift).\nAnd probably thoos is made up of other elements, and these again of\nothers. But if we take a word which is incapable of further resolution,\nthen we shall be right in saying that we have at last reached a primary\nelement, which need not be resolved any further.",
    "HERMOGENES: I believe you to be in the right.",
    "SOCRATES: And suppose the names about which you are now asking should\nturn out to be primary elements, must not their truth or law be\nexamined according to some new method?",
    "HERMOGENES: Very likely.",
    "SOCRATES: Quite so, Hermogenes; all that has preceded would lead to\nthis conclusion. And if, as I think, the conclusion is true, then I\nshall again say to you, come and help me, that I may not fall into some\nabsurdity in stating the principle of primary names.",
    "HERMOGENES: Let me hear, and I will do my best to assist you.",
    "SOCRATES: I think that you will acknowledge with me, that one principle\nis applicable to all names, primary as well as secondary—when they are\nregarded simply as names, there is no difference in them.",
    "HERMOGENES: Certainly not.",
    "SOCRATES: All the names that we have been explaining were intended to\nindicate the nature of things.",
    "HERMOGENES: Of course.",
    "SOCRATES: And that this is true of the primary quite as much as of the\nsecondary names, is implied in their being names.",
    "HERMOGENES: Surely.",
    "SOCRATES: But the secondary, as I conceive, derive their significance\nfrom the primary.",
    "HERMOGENES: That is evident.",
    "SOCRATES: Very good; but then how do the primary names which precede\nanalysis show the natures of things, as far as they can be shown; which\nthey must do, if they are to be real names? And here I will ask you a\nquestion: Suppose that we had no voice or tongue, and wanted to\ncommunicate with one another, should we not, like the deaf and dumb,\nmake signs with the hands and head and the rest of the body?",
    "HERMOGENES: There would be no choice, Socrates.",
    "SOCRATES: We should imitate the nature of the thing; the elevation of\nour hands to heaven would mean lightness and upwardness; heaviness and\ndownwardness would be expressed by letting them drop to the ground; if\nwe were describing the running of a horse, or any other animal, we\nshould make our bodies and their gestures as like as we could to them.",
    "HERMOGENES: I do not see that we could do anything else.",
    "SOCRATES: We could not; for by bodily imitation only can the body ever\nexpress anything.",
    "HERMOGENES: Very true.",
    "SOCRATES: And when we want to express ourselves, either with the voice,\nor tongue, or mouth, the expression is simply their imitation of that\nwhich we want to express.",
    "HERMOGENES: It must be so, I think.",
    "SOCRATES: Then a name is a vocal imitation of that which the vocal\nimitator names or imitates?",
    "HERMOGENES: I think so.",
    "SOCRATES: Nay, my friend, I am disposed to think that we have not\nreached the truth as yet.",
    "HERMOGENES: Why not?",
    "SOCRATES: Because if we have we shall be obliged to admit that the\npeople who imitate sheep, or cocks, or other animals, name that which\nthey imitate.",
    "HERMOGENES: Quite true.",
    "SOCRATES: Then could I have been right in what I was saying?",
    "HERMOGENES: In my opinion, no. But I wish that you would tell me,\nSocrates, what sort of an imitation is a name?",
    "SOCRATES: In the first place, I should reply, not a musical imitation,\nalthough that is also vocal; nor, again, an imitation of what music\nimitates; these, in my judgment, would not be naming. Let me put the\nmatter as follows: All objects have sound and figure, and many have\ncolour?",
    "HERMOGENES: Certainly.",
    "SOCRATES: But the art of naming appears not to be concerned with\nimitations of this kind; the arts which have to do with them are music\nand drawing?",
    "HERMOGENES: True.",
    "SOCRATES: Again, is there not an essence of each thing, just as there\nis a colour, or sound? And is there not an essence of colour and sound\nas well as of anything else which may be said to have an essence?",
    "HERMOGENES: I should think so.",
    "SOCRATES: Well, and if any one could express the essence of each thing\nin letters and syllables, would he not express the nature of each\nthing?",
    "HERMOGENES: Quite so.",
    "SOCRATES: The musician and the painter were the two names which you\ngave to the two other imitators. What will this imitator be called?",
    "HERMOGENES: I imagine, Socrates, that he must be the namer, or\nname-giver, of whom we are in search.",
    "SOCRATES: If this is true, then I think that we are in a condition to\nconsider the names ron (stream), ienai (to go), schesis (retention),\nabout which you were asking; and we may see whether the namer has\ngrasped the nature of them in letters and syllables in such a manner as\nto imitate the essence or not.",
    "HERMOGENES: Very good.",
    "SOCRATES: But are these the only primary names, or are there others?",
    "HERMOGENES: There must be others.",
    "SOCRATES: So I should expect. But how shall we further analyse them,\nand where does the imitator begin? Imitation of the essence is made by\nsyllables and letters; ought we not, therefore, first to separate the\nletters, just as those who are beginning rhythm first distinguish the\npowers of elementary, and then of compound sounds, and when they have\ndone so, but not before, they proceed to the consideration of rhythms?",
    "HERMOGENES: Yes.",
    "SOCRATES: Must we not begin in the same way with letters; first\nseparating the vowels, and then the consonants and mutes (letters which\nare neither vowels nor semivowels), into classes, according to the\nreceived distinctions of the learned; also the semivowels, which are\nneither vowels, nor yet mutes; and distinguishing into classes the\nvowels themselves? And when we have perfected the classification of\nthings, we shall give them names, and see whether, as in the case of\nletters, there are any classes to which they may be all referred (cf.\nPhaedrus); and hence we shall see their natures, and see, too, whether\nthey have in them classes as there are in the letters; and when we have\nwell considered all this, we shall know how to apply them to what they\nresemble—whether one letter is used to denote one thing, or whether\nthere is to be an admixture of several of them; just, as in painting,\nthe painter who wants to depict anything sometimes uses purple only, or\nany other colour, and sometimes mixes up several colours, as his method\nis when he has to paint flesh colour or anything of that kind—he uses\nhis colours as his figures appear to require them; and so, too, we\nshall apply letters to the expression of objects, either single letters\nwhen required, or several letters; and so we shall form syllables, as\nthey are called, and from syllables make nouns and verbs; and thus, at\nlast, from the combinations of nouns and verbs arrive at language,\nlarge and fair and whole; and as the painter made a figure, even so\nshall we make speech by the art of the namer or the rhetorician, or by\nsome other art. Not that I am literally speaking of ourselves, but I\nwas carried away—meaning to say that this was the way in which (not we\nbut) the ancients formed language, and what they put together we must\ntake to pieces in like manner, if we are to attain a scientific view of\nthe whole subject, and we must see whether the primary, and also\nwhether the secondary elements are rightly given or not, for if they\nare not, the composition of them, my dear Hermogenes, will be a sorry\npiece of work, and in the wrong direction.",
    "HERMOGENES: That, Socrates, I can quite believe.",
    "SOCRATES: Well, but do you suppose that you will be able to analyse\nthem in this way? for I am certain that I should not.",
    "HERMOGENES: Much less am I likely to be able.",
    "SOCRATES: Shall we leave them, then? or shall we seek to discover, if\nwe can, something about them, according to the measure of our ability,\nsaying by way of preface, as I said before of the Gods, that of the\ntruth about them we know nothing, and do but entertain human notions of\nthem. And in this present enquiry, let us say to ourselves, before we\nproceed, that the higher method is the one which we or others who would\nanalyse language to any good purpose must follow; but under the\ncircumstances, as men say, we must do as well as we can. What do you\nthink?",
    "HERMOGENES: I very much approve.",
    "SOCRATES: That objects should be imitated in letters and syllables, and\nso find expression, may appear ridiculous, Hermogenes, but it cannot be\navoided—there is no better principle to which we can look for the truth\nof first names. Deprived of this, we must have recourse to divine help,\nlike the tragic poets, who in any perplexity have their gods waiting in\nthe air; and must get out of our difficulty in like fashion, by saying\nthat “the Gods gave the first names, and therefore they are right.”\nThis will be the best contrivance, or perhaps that other notion may be\neven better still, of deriving them from some barbarous people, for the\nbarbarians are older than we are; or we may say that antiquity has cast\na veil over them, which is the same sort of excuse as the last; for all\nthese are not reasons but only ingenious excuses for having no reasons\nconcerning the truth of words. And yet any sort of ignorance of first\nor primitive names involves an ignorance of secondary words; for they\ncan only be explained by the primary. Clearly then the professor of\nlanguages should be able to give a very lucid explanation of first\nnames, or let him be assured he will only talk nonsense about the rest.\nDo you not suppose this to be true?",
    "HERMOGENES: Certainly, Socrates.",
    "SOCRATES: My first notions of original names are truly wild and\nridiculous, though I have no objection to impart them to you if you\ndesire, and I hope that you will communicate to me in return anything\nbetter which you may have.",
    "HERMOGENES: Fear not; I will do my best.",
    "SOCRATES: In the first place, the letter rho appears to me to be the\ngeneral instrument expressing all motion (kinesis). But I have not yet\nexplained the meaning of this latter word, which is just iesis (going);\nfor the letter eta was not in use among the ancients, who only employed\nepsilon; and the root is kiein, which is a foreign form, the same as\nienai. And the old word kinesis will be correctly given as iesis in\ncorresponding modern letters. Assuming this foreign root kiein, and\nallowing for the change of the eta and the insertion of the nu, we have\nkinesis, which should have been kieinsis or eisis; and stasis is the\nnegative of ienai (or eisis), and has been improved into stasis. Now\nthe letter rho, as I was saying, appeared to the imposer of names an\nexcellent instrument for the expression of motion; and he frequently\nuses the letter for this purpose: for example, in the actual words rein\nand roe he represents motion by rho; also in the words tromos\n(trembling), trachus (rugged); and again, in words such as krouein\n(strike), thrauein (crush), ereikein (bruise), thruptein (break),\nkermatixein (crumble), rumbein (whirl): of all these sorts of movements\nhe generally finds an expression in the letter R, because, as I\nimagine, he had observed that the tongue was most agitated and least at\nrest in the pronunciation of this letter, which he therefore used in\norder to express motion, just as by the letter iota he expresses the\nsubtle elements which pass through all things. This is why he uses the\nletter iota as imitative of motion, ienai, iesthai. And there is\nanother class of letters, phi, psi, sigma, and xi, of which the\npronunciation is accompanied by great expenditure of breath; these are\nused in the imitation of such notions as psuchron (shivering), xeon\n(seething), seiesthai, (to be shaken), seismos (shock), and are always\nintroduced by the giver of names when he wants to imitate what is\nphusodes (windy). He seems to have thought that the closing and\npressure of the tongue in the utterance of delta and tau was expressive\nof binding and rest in a place: he further observed the liquid movement\nof lambda, in the pronunciation of which the tongue slips, and in this\nhe found the expression of smoothness, as in leios (level), and in the\nword oliothanein (to slip) itself, liparon (sleek), in the word\nkollodes (gluey), and the like: the heavier sound of gamma detained the\nslipping tongue, and the union of the two gave the notion of a\nglutinous clammy nature, as in glischros, glukus, gloiodes. The nu he\nobserved to be sounded from within, and therefore to have a notion of\ninwardness; hence he introduced the sound in endos and entos: alpha he\nassigned to the expression of size, and nu of length, because they are\ngreat letters: omicron was the sign of roundness, and therefore there\nis plenty of omicron mixed up in the word goggulon (round). Thus did\nthe legislator, reducing all things into letters and syllables, and\nimpressing on them names and signs, and out of them by imitation\ncompounding other signs. That is my view, Hermogenes, of the truth of\nnames; but I should like to hear what Cratylus has more to say.",
    "HERMOGENES: But, Socrates, as I was telling you before, Cratylus\nmystifies me; he says that there is a fitness of names, but he never\nexplains what is this fitness, so that I cannot tell whether his\nobscurity is intended or not. Tell me now, Cratylus, here in the\npresence of Socrates, do you agree in what Socrates has been saying\nabout names, or have you something better of your own? and if you have,\ntell me what your view is, and then you will either learn of Socrates,\nor Socrates and I will learn of you.",
    "CRATYLUS: Well, but surely, Hermogenes, you do not suppose that you can\nlearn, or I explain, any subject of importance all in a moment; at any\nrate, not such a subject as language, which is, perhaps, the very\ngreatest of all.",
    "HERMOGENES: No, indeed; but, as Hesiod says, and I agree with him, “to\nadd little to little” is worth while. And, therefore, if you think that\nyou can add anything at all, however small, to our knowledge, take a\nlittle trouble and oblige Socrates, and me too, who certainly have a\nclaim upon you.",
    "SOCRATES: I am by no means positive, Cratylus, in the view which\nHermogenes and myself have worked out; and therefore do not hesitate to\nsay what you think, which if it be better than my own view I shall\ngladly accept. And I should not be at all surprized to find that you\nhave found some better notion. For you have evidently reflected on\nthese matters and have had teachers, and if you have really a better\ntheory of the truth of names, you may count me in the number of your\ndisciples.",
    "CRATYLUS: You are right, Socrates, in saying that I have made a study\nof these matters, and I might possibly convert you into a disciple. But\nI fear that the opposite is more probable, and I already find myself\nmoved to say to you what Achilles in the “Prayers” says to Ajax,—",
    "“Illustrious Ajax, son of Telamon, lord of the people, You appear to\nhave spoken in all things much to my mind.”",
    "And you, Socrates, appear to me to be an oracle, and to give answers\nmuch to my mind, whether you are inspired by Euthyphro, or whether some\nMuse may have long been an inhabitant of your breast, unconsciously to\nyourself.",
    "SOCRATES: Excellent Cratylus, I have long been wondering at my own\nwisdom; I cannot trust myself. And I think that I ought to stop and ask\nmyself What am I saying? for there is nothing worse than\nself-deception—when the deceiver is always at home and always with\nyou—it is quite terrible, and therefore I ought often to retrace my\nsteps and endeavour to “look fore and aft,” in the words of the\naforesaid Homer. And now let me see; where are we? Have we not been\nsaying that the correct name indicates the nature of the thing:—has\nthis proposition been sufficiently proven?",
    "CRATYLUS: Yes, Socrates, what you say, as I am disposed to think, is\nquite true.",
    "SOCRATES: Names, then, are given in order to instruct?",
    "CRATYLUS: Certainly.",
    "SOCRATES: And naming is an art, and has artificers?",
    "CRATYLUS: Yes.",
    "SOCRATES: And who are they?",
    "CRATYLUS: The legislators, of whom you spoke at first.",
    "SOCRATES: And does this art grow up among men like other arts? Let me\nexplain what I mean: of painters, some are better and some worse?",
    "CRATYLUS: Yes.",
    "SOCRATES: The better painters execute their works, I mean their\nfigures, better, and the worse execute them worse; and of builders\nalso, the better sort build fairer houses, and the worse build them\nworse.",
    "CRATYLUS: True.",
    "SOCRATES: And among legislators, there are some who do their work\nbetter and some worse?",
    "CRATYLUS: No; there I do not agree with you.",
    "SOCRATES: Then you do not think that some laws are better and others\nworse?",
    "CRATYLUS: No, indeed.",
    "SOCRATES: Or that one name is better than another?",
    "CRATYLUS: Certainly not.",
    "SOCRATES: Then all names are rightly imposed?",
    "CRATYLUS: Yes, if they are names at all.",
    "SOCRATES: Well, what do you say to the name of our friend Hermogenes,\nwhich was mentioned before:—assuming that he has nothing of the nature\nof Hermes in him, shall we say that this is a wrong name, or not his\nname at all?",
    "CRATYLUS: I should reply that Hermogenes is not his name at all, but\nonly appears to be his, and is really the name of somebody else, who\nhas the nature which corresponds to it.",
    "SOCRATES: And if a man were to call him Hermogenes, would he not be\neven speaking falsely? For there may be a doubt whether you can call\nhim Hermogenes, if he is not.",
    "CRATYLUS: What do you mean?",
    "SOCRATES: Are you maintaining that falsehood is impossible? For if this\nis your meaning I should answer, that there have been plenty of liars\nin all ages.",
    "CRATYLUS: Why, Socrates, how can a man say that which is not?—say\nsomething and yet say nothing? For is not falsehood saying the thing\nwhich is not?",
    "SOCRATES: Your argument, friend, is too subtle for a man of my age. But\nI should like to know whether you are one of those philosophers who\nthink that falsehood may be spoken but not said?",
    "CRATYLUS: Neither spoken nor said.",
    "SOCRATES: Nor uttered nor addressed? For example: If a person, saluting\nyou in a foreign country, were to take your hand and say: “Hail,\nAthenian stranger, Hermogenes, son of Smicrion”—these words, whether\nspoken, said, uttered, or addressed, would have no application to you\nbut only to our friend Hermogenes, or perhaps to nobody at all?",
    "CRATYLUS: In my opinion, Socrates, the speaker would only be talking\nnonsense.",
    "SOCRATES: Well, but that will be quite enough for me, if you will tell\nme whether the nonsense would be true or false, or partly true and\npartly false:—which is all that I want to know.",
    "CRATYLUS: I should say that he would be putting himself in motion to no\npurpose; and that his words would be an unmeaning sound like the noise\nof hammering at a brazen pot.",
    "SOCRATES: But let us see, Cratylus, whether we cannot find a\nmeeting-point, for you would admit that the name is not the same with\nthe thing named?",
    "CRATYLUS: I should.",
    "SOCRATES: And would you further acknowledge that the name is an\nimitation of the thing?",
    "CRATYLUS: Certainly.",
    "SOCRATES: And you would say that pictures are also imitations of\nthings, but in another way?",
    "CRATYLUS: Yes.",
    "SOCRATES: I believe you may be right, but I do not rightly understand\nyou. Please to say, then, whether both sorts of imitation (I mean both\npictures or words) are not equally attributable and applicable to the\nthings of which they are the imitation.",
    "CRATYLUS: They are.",
    "SOCRATES: First look at the matter thus: you may attribute the likeness\nof the man to the man, and of the woman to the woman; and so on?",
    "CRATYLUS: Certainly.",
    "SOCRATES: And conversely you may attribute the likeness of the man to\nthe woman, and of the woman to the man?",
    "CRATYLUS: Very true.",
    "SOCRATES: And are both modes of assigning them right, or only the\nfirst?",
    "CRATYLUS: Only the first.",
    "SOCRATES: That is to say, the mode of assignment which attributes to\neach that which belongs to them and is like them?",
    "CRATYLUS: That is my view.",
    "SOCRATES: Now then, as I am desirous that we being friends should have\na good understanding about the argument, let me state my view to you:\nthe first mode of assignment, whether applied to figures or to names, I\ncall right, and when applied to names only, true as well as right; and\nthe other mode of giving and assigning the name which is unlike, I call\nwrong, and in the case of names, false as well as wrong.",
    "CRATYLUS: That may be true, Socrates, in the case of pictures; they may\nbe wrongly assigned; but not in the case of names—they must be always\nright.",
    "SOCRATES: Why, what is the difference? May I not go to a man and say to\nhim, “This is your picture,” showing him his own likeness, or perhaps\nthe likeness of a woman; and when I say “show,” I mean bring before the\nsense of sight.",
    "CRATYLUS: Certainly.",
    "SOCRATES: And may I not go to him again, and say, “This is your\nname”?—for the name, like the picture, is an imitation. May I not say\nto him—“This is your name”? and may I not then bring to his sense of\nhearing the imitation of himself, when I say, “This is a man”; or of a\nfemale of the human species, when I say, “This is a woman,” as the case\nmay be? Is not all that quite possible?",
    "CRATYLUS: I would fain agree with you, Socrates; and therefore I say,\nGranted.",
    "SOCRATES: That is very good of you, if I am right, which need hardly be\ndisputed at present. But if I can assign names as well as pictures to\nobjects, the right assignment of them we may call truth, and the wrong\nassignment of them falsehood. Now if there be such a wrong assignment\nof names, there may also be a wrong or inappropriate assignment of\nverbs; and if of names and verbs then of the sentences, which are made\nup of them. What do you say, Cratylus?",
    "CRATYLUS: I agree; and think that what you say is very true.",
    "SOCRATES: And further, primitive nouns may be compared to pictures, and\nin pictures you may either give all the appropriate colours and\nfigures, or you may not give them all—some may be wanting; or there may\nbe too many or too much of them—may there not?",
    "CRATYLUS: Very true.",
    "SOCRATES: And he who gives all gives a perfect picture or figure; and\nhe who takes away or adds also gives a picture or figure, but not a\ngood one.",
    "CRATYLUS: Yes.",
    "SOCRATES: In like manner, he who by syllables and letters imitates the\nnature of things, if he gives all that is appropriate will produce a\ngood image, or in other words a name; but if he subtracts or perhaps\nadds a little, he will make an image but not a good one; whence I infer\nthat some names are well and others ill made.",
    "CRATYLUS: That is true.",
    "SOCRATES: Then the artist of names may be sometimes good, or he may be\nbad?",
    "CRATYLUS: Yes.",
    "SOCRATES: And this artist of names is called the legislator?",
    "CRATYLUS: Yes.",
    "SOCRATES: Then like other artists the legislator may be good or he may\nbe bad; it must surely be so if our former admissions hold good?",
    "CRATYLUS: Very true, Socrates; but the case of language, you see, is\ndifferent; for when by the help of grammar we assign the letters alpha\nor beta, or any other letters to a certain name, then, if we add, or\nsubtract, or misplace a letter, the name which is written is not only\nwritten wrongly, but not written at all; and in any of these cases\nbecomes other than a name.",
    "SOCRATES: But I doubt whether your view is altogether correct,\nCratylus.",
    "CRATYLUS: How so?",
    "SOCRATES: I believe that what you say may be true about numbers, which\nmust be just what they are, or not be at all; for example, the number\nten at once becomes other than ten if a unit be added or subtracted,\nand so of any other number: but this does not apply to that which is\nqualitative or to anything which is represented under an image. I\nshould say rather that the image, if expressing in every point the\nentire reality, would no longer be an image. Let us suppose the\nexistence of two objects: one of them shall be Cratylus, and the other\nthe image of Cratylus; and we will suppose, further, that some God\nmakes not only a representation such as a painter would make of your\noutward form and colour, but also creates an inward organization like\nyours, having the same warmth and softness; and into this infuses\nmotion, and soul, and mind, such as you have, and in a word copies all\nyour qualities, and places them by you in another form; would you say\nthat this was Cratylus and the image of Cratylus, or that there were\ntwo Cratyluses?",
    "CRATYLUS: I should say that there were two Cratyluses.",
    "SOCRATES: Then you see, my friend, that we must find some other\nprinciple of truth in images, and also in names; and not insist that an\nimage is no longer an image when something is added or subtracted. Do\nyou not perceive that images are very far from having qualities which\nare the exact counterpart of the realities which they represent?",
    "CRATYLUS: Yes, I see.",
    "SOCRATES: But then how ridiculous would be the effect of names on\nthings, if they were exactly the same with them! For they would be the\ndoubles of them, and no one would be able to determine which were the\nnames and which were the realities.",
    "CRATYLUS: Quite true.",
    "SOCRATES: Then fear not, but have the courage to admit that one name\nmay be correctly and another incorrectly given; and do not insist that\nthe name shall be exactly the same with the thing; but allow the\noccasional substitution of a wrong letter, and if of a letter also of a\nnoun in a sentence, and if of a noun in a sentence also of a sentence\nwhich is not appropriate to the matter, and acknowledge that the thing\nmay be named, and described, so long as the general character of the\nthing which you are describing is retained; and this, as you will\nremember, was remarked by Hermogenes and myself in the particular\ninstance of the names of the letters.",
    "CRATYLUS: Yes, I remember.",
    "SOCRATES: Good; and when the general character is preserved, even if\nsome of the proper letters are wanting, still the thing is\nsignified;—well, if all the letters are given; not well, when only a\nfew of them are given. I think that we had better admit this, lest we\nbe punished like travellers in Aegina who wander about the street late\nat night: and be likewise told by truth herself that we have arrived\ntoo late; or if not, you must find out some new notion of correctness\nof names, and no longer maintain that a name is the expression of a\nthing in letters or syllables; for if you say both, you will be\ninconsistent with yourself.",
    "CRATYLUS: I quite acknowledge, Socrates, what you say to be very\nreasonable.",
    "SOCRATES: Then as we are agreed thus far, let us ask ourselves whether\na name rightly imposed ought not to have the proper letters.",
    "CRATYLUS: Yes.",
    "SOCRATES: And the proper letters are those which are like the things?",
    "CRATYLUS: Yes.",
    "SOCRATES: Enough then of names which are rightly given. And in names\nwhich are incorrectly given, the greater part may be supposed to be\nmade up of proper and similar letters, or there would be no likeness;\nbut there will be likewise a part which is improper and spoils the\nbeauty and formation of the word: you would admit that?",
    "CRATYLUS: There would be no use, Socrates, in my quarrelling with you,\nsince I cannot be satisfied that a name which is incorrectly given is a\nname at all.",
    "SOCRATES: Do you admit a name to be the representation of a thing?",
    "CRATYLUS: Yes, I do.",
    "SOCRATES: But do you not allow that some nouns are primitive, and some\nderived?",
    "CRATYLUS: Yes, I do.",
    "SOCRATES: Then if you admit that primitive or first nouns are\nrepresentations of things, is there any better way of framing\nrepresentations than by assimilating them to the objects as much as you\ncan; or do you prefer the notion of Hermogenes and of many others, who\nsay that names are conventional, and have a meaning to those who have\nagreed about them, and who have previous knowledge of the things\nintended by them, and that convention is the only principle; and\nwhether you abide by our present convention, or make a new and opposite\none, according to which you call small great and great small—that, they\nwould say, makes no difference, if you are only agreed. Which of these\ntwo notions do you prefer?",
    "CRATYLUS: Representation by likeness, Socrates, is infinitely better\nthan representation by any chance sign.",
    "SOCRATES: Very good: but if the name is to be like the thing, the\nletters out of which the first names are composed must also be like\nthings. Returning to the image of the picture, I would ask, How could\nany one ever compose a picture which would be like anything at all, if\nthere were not pigments in nature which resembled the things imitated,\nand out of which the picture is composed?",
    "CRATYLUS: Impossible.",
    "SOCRATES: No more could names ever resemble any actually existing\nthing, unless the original elements of which they are compounded bore\nsome degree of resemblance to the objects of which the names are the\nimitation: And the original elements are letters?",
    "CRATYLUS: Yes.",
    "SOCRATES: Let me now invite you to consider what Hermogenes and I were\nsaying about sounds. Do you agree with me that the letter rho is\nexpressive of rapidity, motion, and hardness? Were we right or wrong in\nsaying so?",
    "CRATYLUS: I should say that you were right.",
    "SOCRATES: And that lamda was expressive of smoothness, and softness,\nand the like?",
    "CRATYLUS: There again you were right.",
    "SOCRATES: And yet, as you are aware, that which is called by us\nsklerotes, is by the Eretrians called skleroter.",
    "CRATYLUS: Very true.",
    "SOCRATES: But are the letters rho and sigma equivalents; and is there\nthe same significance to them in the termination rho, which there is to\nus in sigma, or is there no significance to one of us?",
    "CRATYLUS: Nay, surely there is a significance to both of us.",
    "SOCRATES: In as far as they are like, or in as far as they are unlike?",
    "CRATYLUS: In as far as they are like.",
    "SOCRATES: Are they altogether alike?",
    "CRATYLUS: Yes; for the purpose of expressing motion.",
    "SOCRATES: And what do you say of the insertion of the lamda? for that\nis expressive not of hardness but of softness.",
    "CRATYLUS: Why, perhaps the letter lamda is wrongly inserted, Socrates,\nand should be altered into rho, as you were saying to Hermogenes and in\nmy opinion rightly, when you spoke of adding and subtracting letters\nupon occasion.",
    "SOCRATES: Good. But still the word is intelligible to both of us; when\nI say skleros (hard), you know what I mean.",
    "CRATYLUS: Yes, my dear friend, and the explanation of that is custom.",
    "SOCRATES: And what is custom but convention? I utter a sound which I\nunderstand, and you know that I understand the meaning of the sound:\nthis is what you are saying?",
    "CRATYLUS: Yes.",
    "SOCRATES: And if when I speak you know my meaning, there is an\nindication given by me to you?",
    "CRATYLUS: Yes.",
    "SOCRATES: This indication of my meaning may proceed from unlike as well\nas from like, for example in the lamda of sklerotes. But if this is\ntrue, then you have made a convention with yourself, and the\ncorrectness of a name turns out to be convention, since letters which\nare unlike are indicative equally with those which are like, if they\nare sanctioned by custom and convention. And even supposing that you\ndistinguish custom from convention ever so much, still you must say\nthat the signification of words is given by custom and not by likeness,\nfor custom may indicate by the unlike as well as by the like. But as we\nare agreed thus far, Cratylus (for I shall assume that your silence\ngives consent), then custom and convention must be supposed to\ncontribute to the indication of our thoughts; for suppose we take the\ninstance of number, how can you ever imagine, my good friend, that you\nwill find names resembling every individual number, unless you allow\nthat which you term convention and agreement to have authority in\ndetermining the correctness of names? I quite agree with you that words\nshould as far as possible resemble things; but I fear that this\ndragging in of resemblance, as Hermogenes says, is a shabby thing,\nwhich has to be supplemented by the mechanical aid of convention with a\nview to correctness; for I believe that if we could always, or almost\nalways, use likenesses, which are perfectly appropriate, this would be\nthe most perfect state of language; as the opposite is the most\nimperfect. But let me ask you, what is the force of names, and what is\nthe use of them?",
    "CRATYLUS: The use of names, Socrates, as I should imagine, is to\ninform: the simple truth is, that he who knows names knows also the\nthings which are expressed by them.",
    "SOCRATES: I suppose you mean to say, Cratylus, that as the name is, so\nalso is the thing; and that he who knows the one will also know the\nother, because they are similars, and all similars fall under the same\nart or science; and therefore you would say that he who knows names\nwill also know things.",
    "CRATYLUS: That is precisely what I mean.",
    "SOCRATES: But let us consider what is the nature of this information\nabout things which, according to you, is given us by names. Is it the\nbest sort of information? or is there any other? What do you say?",
    "CRATYLUS: I believe that to be both the only and the best sort of\ninformation about them; there can be no other.",
    "SOCRATES: But do you believe that in the discovery of them, he who\ndiscovers the names discovers also the things; or is this only the\nmethod of instruction, and is there some other method of enquiry and\ndiscovery.",
    "CRATYLUS: I certainly believe that the methods of enquiry and discovery\nare of the same nature as instruction.",
    "SOCRATES: Well, but do you not see, Cratylus, that he who follows names\nin the search after things, and analyses their meaning, is in great\ndanger of being deceived?",
    "CRATYLUS: How so?",
    "SOCRATES: Why clearly he who first gave names gave them according to\nhis conception of the things which they signified—did he not?",
    "CRATYLUS: True.",
    "SOCRATES: And if his conception was erroneous, and he gave names\naccording to his conception, in what position shall we who are his\nfollowers find ourselves? Shall we not be deceived by him?",
    "CRATYLUS: But, Socrates, am I not right in thinking that he must surely\nhave known; or else, as I was saying, his names would not be names at\nall? And you have a clear proof that he has not missed the truth, and\nthe proof is—that he is perfectly consistent. Did you ever observe in\nspeaking that all the words which you utter have a common character and\npurpose?",
    "SOCRATES: But that, friend Cratylus, is no answer. For if he did begin\nin error, he may have forced the remainder into agreement with the\noriginal error and with himself; there would be nothing strange in\nthis, any more than in geometrical diagrams, which have often a slight\nand invisible flaw in the first part of the process, and are\nconsistently mistaken in the long deductions which follow. And this is\nthe reason why every man should expend his chief thought and attention\non the consideration of his first principles:—are they or are they not\nrightly laid down? and when he has duly sifted them, all the rest will\nfollow. Now I should be astonished to find that names are really\nconsistent. And here let us revert to our former discussion: Were we\nnot saying that all things are in motion and progress and flux, and\nthat this idea of motion is expressed by names? Do you not conceive\nthat to be the meaning of them?",
    "CRATYLUS: Yes; that is assuredly their meaning, and the true meaning.",
    "SOCRATES: Let us revert to episteme (knowledge) and observe how\nambiguous this word is, seeming rather to signify stopping the soul at\nthings than going round with them; and therefore we should leave the\nbeginning as at present, and not reject the epsilon, but make an\ninsertion of an iota instead of an epsilon (not pioteme, but\nepiisteme). Take another example: bebaion (sure) is clearly the\nexpression of station and position, and not of motion. Again, the word\nistoria (enquiry) bears upon the face of it the stopping (istanai) of\nthe stream; and the word piston (faithful) certainly indicates\ncessation of motion; then, again, mneme (memory), as any one may see,\nexpresses rest in the soul, and not motion. Moreover, words such as\namartia and sumphora, which have a bad sense, viewed in the light of\ntheir etymologies will be the same as sunesis and episteme and other\nwords which have a good sense (compare omartein, sunienai, epesthai,\nsumpheresthai); and much the same may be said of amathia and akolasia,\nfor amathia may be explained as e ama theo iontos poreia, and akolasia\nas e akolouthia tois pragmasin. Thus the names which in these instances\nwe find to have the worst sense, will turn out to be framed on the same\nprinciple as those which have the best. And any one I believe who would\ntake the trouble might find many other examples in which the giver of\nnames indicates, not that things are in motion or progress, but that\nthey are at rest; which is the opposite of motion.",
    "CRATYLUS: Yes, Socrates, but observe; the greater number express\nmotion.",
    "SOCRATES: What of that, Cratylus? Are we to count them like votes? and\nis correctness of names the voice of the majority? Are we to say of\nwhichever sort there are most, those are the true ones?",
    "CRATYLUS: No; that is not reasonable.",
    "SOCRATES: Certainly not. But let us have done with this question and\nproceed to another, about which I should like to know whether you think\nwith me. Were we not lately acknowledging that the first givers of\nnames in states, both Hellenic and barbarous, were the legislators, and\nthat the art which gave names was the art of the legislator?",
    "CRATYLUS: Quite true.",
    "SOCRATES: Tell me, then, did the first legislators, who were the givers\nof the first names, know or not know the things which they named?",
    "CRATYLUS: They must have known, Socrates.",
    "SOCRATES: Why, yes, friend Cratylus, they could hardly have been\nignorant.",
    "CRATYLUS: I should say not.",
    "SOCRATES: Let us return to the point from which we digressed. You were\nsaying, if you remember, that he who gave names must have known the\nthings which he named; are you still of that opinion?",
    "CRATYLUS: I am.",
    "SOCRATES: And would you say that the giver of the first names had also\na knowledge of the things which he named?",
    "CRATYLUS: I should.",
    "SOCRATES: But how could he have learned or discovered things from names\nif the primitive names were not yet given? For, if we are correct in\nour view, the only way of learning and discovering things, is either to\ndiscover names for ourselves or to learn them from others.",
    "CRATYLUS: I think that there is a good deal in what you say, Socrates.",
    "SOCRATES: But if things are only to be known through names, how can we\nsuppose that the givers of names had knowledge, or were legislators\nbefore there were names at all, and therefore before they could have\nknown them?",
    "CRATYLUS: I believe, Socrates, the true account of the matter to be,\nthat a power more than human gave things their first names, and that\nthe names which are thus given are necessarily their true names.",
    "SOCRATES: Then how came the giver of the names, if he was an inspired\nbeing or God, to contradict himself? For were we not saying just now\nthat he made some names expressive of rest and others of motion? Were\nwe mistaken?",
    "CRATYLUS: But I suppose one of the two not to be names at all.",
    "SOCRATES: And which, then, did he make, my good friend; those which are\nexpressive of rest, or those which are expressive of motion? This is a\npoint which, as I said before, cannot be determined by counting them.",
    "CRATYLUS: No; not in that way, Socrates.",
    "SOCRATES: But if this is a battle of names, some of them asserting that\nthey are like the truth, others contending that THEY are, how or by\nwhat criterion are we to decide between them? For there are no other\nnames to which appeal can be made, but obviously recourse must be had\nto another standard which, without employing names, will make clear\nwhich of the two are right; and this must be a standard which shows the\ntruth of things.",
    "CRATYLUS: I agree.",
    "SOCRATES: But if that is true, Cratylus, then I suppose that things may\nbe known without names?",
    "CRATYLUS: Clearly.",
    "SOCRATES: But how would you expect to know them? What other way can\nthere be of knowing them, except the true and natural way, through\ntheir affinities, when they are akin to each other, and through\nthemselves? For that which is other and different from them must\nsignify something other and different from them.",
    "CRATYLUS: What you are saying is, I think, true.",
    "SOCRATES: Well, but reflect; have we not several times acknowledged\nthat names rightly given are the likenesses and images of the things\nwhich they name?",
    "CRATYLUS: Yes.",
    "SOCRATES: Let us suppose that to any extent you please you can learn\nthings through the medium of names, and suppose also that you can learn\nthem from the things themselves—which is likely to be the nobler and\nclearer way; to learn of the image, whether the image and the truth of\nwhich the image is the expression have been rightly conceived, or to\nlearn of the truth whether the truth and the image of it have been duly\nexecuted?",
    "CRATYLUS: I should say that we must learn of the truth.",
    "SOCRATES: How real existence is to be studied or discovered is, I\nsuspect, beyond you and me. But we may admit so much, that the\nknowledge of things is not to be derived from names. No; they must be\nstudied and investigated in themselves.",
    "CRATYLUS: Clearly, Socrates.",
    "SOCRATES: There is another point. I should not like us to be imposed\nupon by the appearance of such a multitude of names, all tending in the\nsame direction. I myself do not deny that the givers of names did\nreally give them under the idea that all things were in motion and\nflux; which was their sincere but, I think, mistaken opinion. And\nhaving fallen into a kind of whirlpool themselves, they are carried\nround, and want to drag us in after them. There is a matter, master\nCratylus, about which I often dream, and should like to ask your\nopinion: Tell me, whether there is or is not any absolute beauty or\ngood, or any other absolute existence?",
    "CRATYLUS: Certainly, Socrates, I think so.",
    "SOCRATES: Then let us seek the true beauty: not asking whether a face\nis fair, or anything of that sort, for all such things appear to be in\na flux; but let us ask whether the true beauty is not always beautiful.",
    "CRATYLUS: Certainly.",
    "SOCRATES: And can we rightly speak of a beauty which is always passing\naway, and is first this and then that; must not the same thing be born\nand retire and vanish while the word is in our mouths?",
    "CRATYLUS: Undoubtedly.",
    "SOCRATES: Then how can that be a real thing which is never in the same\nstate? for obviously things which are the same cannot change while they\nremain the same; and if they are always the same and in the same state,\nand never depart from their original form, they can never change or be\nmoved.",
    "CRATYLUS: Certainly they cannot.",
    "SOCRATES: Nor yet can they be known by any one; for at the moment that\nthe observer approaches, then they become other and of another nature,\nso that you cannot get any further in knowing their nature or state,\nfor you cannot know that which has no state.",
    "CRATYLUS: True.",
    "SOCRATES: Nor can we reasonably say, Cratylus, that there is knowledge\nat all, if everything is in a state of transition and there is nothing\nabiding; for knowledge too cannot continue to be knowledge unless\ncontinuing always to abide and exist. But if the very nature of\nknowledge changes, at the time when the change occurs there will be no\nknowledge; and if the transition is always going on, there will always\nbe no knowledge, and, according to this view, there will be no one to\nknow and nothing to be known: but if that which knows and that which is\nknown exists ever, and the beautiful and the good and every other thing\nalso exist, then I do not think that they can resemble a process or\nflux, as we were just now supposing. Whether there is this eternal\nnature in things, or whether the truth is what Heracleitus and his\nfollowers and many others say, is a question hard to determine; and no\nman of sense will like to put himself or the education of his mind in\nthe power of names: neither will he so far trust names or the givers of\nnames as to be confident in any knowledge which condemns himself and\nother existences to an unhealthy state of unreality; he will not\nbelieve that all things leak like a pot, or imagine that the world is a\nman who has a running at the nose. This may be true, Cratylus, but is\nalso very likely to be untrue; and therefore I would not have you be\ntoo easily persuaded of it. Reflect well and like a man, and do not\neasily accept such a doctrine; for you are young and of an age to\nlearn. And when you have found the truth, come and tell me.",
    "CRATYLUS: I will do as you say, though I can assure you, Socrates, that\nI have been considering the matter already, and the result of a great\ndeal of trouble and consideration is that I incline to Heracleitus.",
    "SOCRATES: Then, another day, my friend, when you come back, you shall\ngive me a lesson; but at present, go into the country, as you are\nintending, and Hermogenes shall set you on your way.",
    "CRATYLUS: Very good, Socrates; I hope, however, that you will continue\nto think about these things yourself."
  ]
}
