{
  "paragraphs": [
    "MENEXENUS",
    "by Plato",
    "(see Appendix I)",
    "Translated by Benjamin Jowett",
    "APPENDIX I.",
    "It seems impossible to separate by any exact line the genuine writings\nof Plato from the spurious. The only external evidence to them which is\nof much value is that of Aristotle; for the Alexandrian catalogues of\na century later include manifest forgeries. Even the value of the\nAristotelian authority is a good deal impaired by the uncertainty\nconcerning the date and authorship of the writings which are ascribed to\nhim. And several of the citations of Aristotle omit the name of Plato,\nand some of them omit the name of the dialogue from which they are\ntaken. Prior, however, to the enquiry about the writings of a particular\nauthor, general considerations which equally affect all evidence to the\ngenuineness of ancient writings are the following: Shorter works are\nmore likely to have been forged, or to have received an erroneous\ndesignation, than longer ones; and some kinds of composition, such as\nepistles or panegyrical orations, are more liable to suspicion than\nothers; those, again, which have a taste of sophistry in them, or the\nring of a later age, or the slighter character of a rhetorical exercise,\nor in which a motive or some affinity to spurious writings can be\ndetected, or which seem to have originated in a name or statement really\noccurring in some classical author, are also of doubtful credit; while\nthere is no instance of any ancient writing proved to be a forgery,\nwhich combines excellence with length. A really great and original\nwriter would have no object in fathering his works on Plato; and to the\nforger or imitator, the 'literary hack' of Alexandria and Athens, the\nGods did not grant originality or genius. Further, in attempting to\nbalance the evidence for and against a Platonic dialogue, we must not\nforget that the form of the Platonic writing was common to several of\nhis contemporaries. Aeschines, Euclid, Phaedo, Antisthenes, and in the\nnext generation Aristotle, are all said to have composed dialogues; and\nmistakes of names are very likely to have occurred. Greek literature in\nthe third century before Christ was almost as voluminous as our own, and\nwithout the safeguards of regular publication, or printing, or binding,\nor even of distinct titles. An unknown writing was naturally attributed\nto a known writer whose works bore the same character; and the name once\nappended easily obtained authority. A tendency may also be observed to\nblend the works and opinions of the master with those of his scholars.\nTo a later Platonist, the difference between Plato and his imitators was\nnot so perceptible as to ourselves. The Memorabilia of Xenophon and the\nDialogues of Plato are but a part of a considerable Socratic literature\nwhich has passed away. And we must consider how we should regard the\nquestion of the genuineness of a particular writing, if this lost\nliterature had been preserved to us.",
    "These considerations lead us to adopt the following criteria of\ngenuineness: (1) That is most certainly Plato's which Aristotle\nattributes to him by name, which (2) is of considerable length, of (3)\ngreat excellence, and also (4) in harmony with the general spirit of\nthe Platonic writings. But the testimony of Aristotle cannot always\nbe distinguished from that of a later age (see above); and has various\ndegrees of importance. Those writings which he cites without mentioning\nPlato, under their own names, e.g. the Hippias, the Funeral Oration, the\nPhaedo, etc., have an inferior degree of evidence in their favour. They\nmay have been supposed by him to be the writings of another, although in\nthe case of really great works, e.g. the Phaedo, this is not credible;\nthose again which are quoted but not named, are still more defective\nin their external credentials. There may be also a possibility that\nAristotle was mistaken, or may have confused the master and his scholars\nin the case of a short writing; but this is inconceivable about a more\nimportant work, e.g. the Laws, especially when we remember that he was\nliving at Athens, and a frequenter of the groves of the Academy, during\nthe last twenty years of Plato's life. Nor must we forget that in all\nhis numerous citations from the Platonic writings he never attributes\nany passage found in the extant dialogues to any one but Plato. And\nlastly, we may remark that one or two great writings, such as the\nParmenides and the Politicus, which are wholly devoid of Aristotelian\n(1) credentials may be fairly attributed to Plato, on the ground of (2)\nlength, (3) excellence, and (4) accordance with the general spirit\nof his writings. Indeed the greater part of the evidence for the\ngenuineness of ancient Greek authors may be summed up under two heads\nonly: (1) excellence; and (2) uniformity of tradition--a kind of\nevidence, which though in many cases sufficient, is of inferior value.",
    "Proceeding upon these principles we appear to arrive at the conclusion\nthat nineteen-twentieths of all the writings which have ever been\nascribed to Plato, are undoubtedly genuine. There is another portion of\nthem, including the Epistles, the Epinomis, the dialogues rejected by\nthe ancients themselves, namely, the Axiochus, De justo, De virtute,\nDemodocus, Sisyphus, Eryxias, which on grounds, both of internal and\nexternal evidence, we are able with equal certainty to reject. But there\nstill remains a small portion of which we are unable to affirm either\nthat they are genuine or spurious. They may have been written in youth,\nor possibly like the works of some painters, may be partly or wholly\nthe compositions of pupils; or they may have been the writings of some\ncontemporary transferred by accident to the more celebrated name of\nPlato, or of some Platonist in the next generation who aspired to\nimitate his master. Not that on grounds either of language or philosophy\nwe should lightly reject them. Some difference of style, or inferiority\nof execution, or inconsistency of thought, can hardly be considered\ndecisive of their spurious character. For who always does justice to\nhimself, or who writes with equal care at all times? Certainly not\nPlato, who exhibits the greatest differences in dramatic power, in the\nformation of sentences, and in the use of words, if his earlier writings\nare compared with his later ones, say the Protagoras or Phaedrus with\nthe Laws. Or who can be expected to think in the same manner during\na period of authorship extending over above fifty years, in an age\nof great intellectual activity, as well as of political and literary\ntransition? Certainly not Plato, whose earlier writings are separated\nfrom his later ones by as wide an interval of philosophical speculation\nas that which separates his later writings from Aristotle.",
    "The dialogues which have been translated in the first Appendix, and\nwhich appear to have the next claim to genuineness among the Platonic\nwritings, are the Lesser Hippias, the Menexenus or Funeral Oration, the\nFirst Alcibiades. Of these, the Lesser Hippias and the Funeral Oration\nare cited by Aristotle; the first in the Metaphysics, the latter in the\nRhetoric. Neither of them are expressly attributed to Plato, but in his\ncitation of both of them he seems to be referring to passages in the\nextant dialogues. From the mention of 'Hippias' in the singular by\nAristotle, we may perhaps infer that he was unacquainted with a second\ndialogue bearing the same name. Moreover, the mere existence of a\nGreater and Lesser Hippias, and of a First and Second Alcibiades, does\nto a certain extent throw a doubt upon both of them. Though a very\nclever and ingenious work, the Lesser Hippias does not appear to contain\nanything beyond the power of an imitator, who was also a careful student\nof the earlier Platonic writings, to invent. The motive or leading\nthought of the dialogue may be detected in Xen. Mem., and there is\nno similar instance of a 'motive' which is taken from Xenophon in an\nundoubted dialogue of Plato. On the other hand, the upholders of the\ngenuineness of the dialogue will find in the Hippias a true Socratic\nspirit; they will compare the Ion as being akin both in subject and\ntreatment; they will urge the authority of Aristotle; and they will\ndetect in the treatment of the Sophist, in the satirical reasoning\nupon Homer, in the reductio ad absurdum of the doctrine that vice is\nignorance, traces of a Platonic authorship. In reference to the last\npoint we are doubtful, as in some of the other dialogues, whether the\nauthor is asserting or overthrowing the paradox of Socrates, or merely\nfollowing the argument 'whither the wind blows.' That no conclusion\nis arrived at is also in accordance with the character of the earlier\ndialogues. The resemblances or imitations of the Gorgias, Protagoras,\nand Euthydemus, which have been observed in the Hippias, cannot with\ncertainty be adduced on either side of the argument. On the whole, more\nmay be said in favour of the genuineness of the Hippias than against it.",
    "The Menexenus or Funeral Oration is cited by Aristotle, and is\ninteresting as supplying an example of the manner in which the orators\npraised 'the Athenians among the Athenians,' falsifying persons and\ndates, and casting a veil over the gloomier events of Athenian history.\nIt exhibits an acquaintance with the funeral oration of Thucydides, and\nwas, perhaps, intended to rival that great work. If genuine, the\nproper place of the Menexenus would be at the end of the Phaedrus. The\nsatirical opening and the concluding words bear a great resemblance to\nthe earlier dialogues; the oration itself is professedly a mimetic work,\nlike the speeches in the Phaedrus, and cannot therefore be tested by\na comparison of the other writings of Plato. The funeral oration of\nPericles is expressly mentioned in the Phaedrus, and this may have\nsuggested the subject, in the same manner that the Cleitophon appears to\nbe suggested by the slight mention of Cleitophon and his attachment to\nThrasymachus in the Republic; and the Theages by the mention of Theages\nin the Apology and Republic; or as the Second Alcibiades seems to be\nfounded upon the text of Xenophon, Mem. A similar taste for parody\nappears not only in the Phaedrus, but in the Protagoras, in the\nSymposium, and to a certain extent in the Parmenides.",
    "To these two doubtful writings of Plato I have added the First\nAlcibiades, which, of all the disputed dialogues of Plato, has the\ngreatest merit, and is somewhat longer than any of them, though not\nverified by the testimony of Aristotle, and in many respects at variance\nwith the Symposium in the description of the relations of Socrates\nand Alcibiades. Like the Lesser Hippias and the Menexenus, it is to be\ncompared to the earlier writings of Plato. The motive of the piece may,\nperhaps, be found in that passage of the Symposium in which Alcibiades\ndescribes himself as self-convicted by the words of Socrates. For the\ndisparaging manner in which Schleiermacher has spoken of this dialogue\nthere seems to be no sufficient foundation. At the same time, the lesson\nimparted is simple, and the irony more transparent than in the undoubted\ndialogues of Plato. We know, too, that Alcibiades was a favourite\nthesis, and that at least five or six dialogues bearing this name passed\ncurrent in antiquity, and are attributed to contemporaries of Socrates\nand Plato. (1) In the entire absence of real external evidence (for\nthe catalogues of the Alexandrian librarians cannot be regarded as\ntrustworthy); and (2) in the absence of the highest marks either of\npoetical or philosophical excellence; and (3) considering that we have\nexpress testimony to the existence of contemporary writings bearing\nthe name of Alcibiades, we are compelled to suspend our judgment on the\ngenuineness of the extant dialogue.",
    "Neither at this point, nor at any other, do we propose to draw an\nabsolute line of demarcation between genuine and spurious writings of\nPlato. They fade off imperceptibly from one class to another. There may\nhave been degrees of genuineness in the dialogues themselves, as there\nare certainly degrees of evidence by which they are supported. The\ntraditions of the oral discourses both of Socrates and Plato may have\nformed the basis of semi-Platonic writings; some of them may be of the\nsame mixed character which is apparent in Aristotle and Hippocrates,\nalthough the form of them is different. But the writings of Plato,\nunlike the writings of Aristotle, seem never to have been confused with\nthe writings of his disciples: this was probably due to their definite\nform, and to their inimitable excellence. The three dialogues which\nwe have offered in the Appendix to the criticism of the reader may\nbe partly spurious and partly genuine; they may be altogether\nspurious;--that is an alternative which must be frankly admitted. Nor\ncan we maintain of some other dialogues, such as the Parmenides, and\nthe Sophist, and Politicus, that no considerable objection can be urged\nagainst them, though greatly overbalanced by the weight (chiefly)\nof internal evidence in their favour. Nor, on the other hand, can\nwe exclude a bare possibility that some dialogues which are usually\nrejected, such as the Greater Hippias and the Cleitophon, may be\ngenuine. The nature and object of these semi-Platonic writings require\nmore careful study and more comparison of them with one another, and\nwith forged writings in general, than they have yet received, before we\ncan finally decide on their character. We do not consider them all as\ngenuine until they can be proved to be spurious, as is often maintained\nand still more often implied in this and similar discussions; but\nshould say of some of them, that their genuineness is neither proven nor\ndisproven until further evidence about them can be adduced. And we are\nas confident that the Epistles are spurious, as that the Republic, the\nTimaeus, and the Laws are genuine.",
    "On the whole, not a twentieth part of the writings which pass under\nthe name of Plato, if we exclude the works rejected by the ancients\nthemselves and two or three other plausible inventions, can be fairly\ndoubted by those who are willing to allow that a considerable change\nand growth may have taken place in his philosophy (see above). That\ntwentieth debatable portion scarcely in any degree affects our judgment\nof Plato, either as a thinker or a writer, and though suggesting some\ninteresting questions to the scholar and critic, is of little importance\nto the general reader.",
    "MENEXENUS",
    "INTRODUCTION.",
    "The Menexenus has more the character of a rhetorical exercise than any\nother of the Platonic works. The writer seems to have wished to emulate\nThucydides, and the far slighter work of Lysias. In his rivalry with the\nlatter, to whom in the Phaedrus Plato shows a strong antipathy, he is\nentirely successful, but he is not equal to Thucydides. The Menexenus,\nthough not without real Hellenic interest, falls very far short of\nthe rugged grandeur and political insight of the great historian. The\nfiction of the speech having been invented by Aspasia is well sustained,\nand is in the manner of Plato, notwithstanding the anachronism which\nputs into her mouth an allusion to the peace of Antalcidas, an event\noccurring forty years after the date of the supposed oration. But\nPlato, like Shakespeare, is careless of such anachronisms, which are not\nsupposed to strike the mind of the reader. The effect produced by these\ngrandiloquent orations on Socrates, who does not recover after having\nheard one of them for three days and more, is truly Platonic.",
    "Such discourses, if we may form a judgment from the three which are\nextant (for the so-called Funeral Oration of Demosthenes is a bad and\nspurious imitation of Thucydides and Lysias), conformed to a regular\ntype. They began with Gods and ancestors, and the legendary history of\nAthens, to which succeeded an almost equally fictitious account of later\ntimes. The Persian war usually formed the centre of the narrative; in\nthe age of Isocrates and Demosthenes the Athenians were still living on\nthe glories of Marathon and Salamis. The Menexenus veils in panegyric\nthe weak places of Athenian history. The war of Athens and Boeotia is\na war of liberation; the Athenians gave back the Spartans taken at\nSphacteria out of kindness--indeed, the only fault of the city was too\ngreat kindness to their enemies, who were more honoured than the friends\nof others (compare Thucyd., which seems to contain the germ of the\nidea); we democrats are the aristocracy of virtue, and the like. These\nare the platitudes and falsehoods in which history is disguised. The\ntaking of Athens is hardly mentioned.",
    "The author of the Menexenus, whether Plato or not, is evidently\nintending to ridicule the practice, and at the same time to show that he\ncan beat the rhetoricians in their own line, as in the Phaedrus he may\nbe supposed to offer an example of what Lysias might have said, and of\nhow much better he might have written in his own style. The orators had\nrecourse to their favourite loci communes, one of which, as we find in\nLysias, was the shortness of the time allowed them for preparation. But\nSocrates points out that they had them always ready for delivery, and\nthat there was no difficulty in improvising any number of such orations.\nTo praise the Athenians among the Athenians was easy,--to praise them\namong the Lacedaemonians would have been a much more difficult task.\nSocrates himself has turned rhetorician, having learned of a woman,\nAspasia, the mistress of Pericles; and any one whose teachers had been\nfar inferior to his own--say, one who had learned from Antiphon\nthe Rhamnusian--would be quite equal to the task of praising men to\nthemselves. When we remember that Antiphon is described by Thucydides as\nthe best pleader of his day, the satire on him and on the whole tribe of\nrhetoricians is transparent.",
    "The ironical assumption of Socrates, that he must be a good orator\nbecause he had learnt of Aspasia, is not coarse, as Schleiermacher\nsupposes, but is rather to be regarded as fanciful. Nor can we say that\nthe offer of Socrates to dance naked out of love for Menexenus, is any\nmore un-Platonic than the threat of physical force which Phaedrus uses\ntowards Socrates. Nor is there any real vulgarity in the fear which\nSocrates expresses that he will get a beating from his mistress,\nAspasia: this is the natural exaggeration of what might be expected from\nan imperious woman. Socrates is not to be taken seriously in all that\nhe says, and Plato, both in the Symposium and elsewhere, is not slow to\nadmit a sort of Aristophanic humour. How a great original genius like\nPlato might or might not have written, what was his conception of\nhumour, or what limits he would have prescribed to himself, if any,\nin drawing the picture of the Silenus Socrates, are problems which no\ncritical instinct can determine.",
    "On the other hand, the dialogue has several Platonic traits, whether\noriginal or imitated may be uncertain. Socrates, when he departs from\nhis character of a 'know nothing' and delivers a speech, generally\npretends that what he is speaking is not his own composition. Thus in\nthe Cratylus he is run away with; in the Phaedrus he has heard somebody\nsay something--is inspired by the genius loci; in the Symposium he\nderives his wisdom from Diotima of Mantinea, and the like. But he does\nnot impose on Menexenus by his dissimulation. Without violating the\ncharacter of Socrates, Plato, who knows so well how to give a hint, or\nsome one writing in his name, intimates clearly enough that the speech\nin the Menexenus like that in the Phaedrus is to be attributed to\nSocrates. The address of the dead to the living at the end of the\noration may also be compared to the numerous addresses of the same kind\nwhich occur in Plato, in whom the dramatic element is always tending to\nprevail over the rhetorical. The remark has been often made, that in the\nFuneral Oration of Thucydides there is no allusion to the existence of\nthe dead. But in the Menexenus a future state is clearly, although not\nstrongly, asserted.",
    "Whether the Menexenus is a genuine writing of Plato, or an imitation\nonly, remains uncertain. In either case, the thoughts are partly\nborrowed from the Funeral Oration of Thucydides; and the fact that\nthey are so, is not in favour of the genuineness of the work. Internal\nevidence seems to leave the question of authorship in doubt. There are\nmerits and there are defects which might lead to either conclusion. The\nform of the greater part of the work makes the enquiry difficult; the\nintroduction and the finale certainly wear the look either of Plato or\nof an extremely skilful imitator. The excellence of the forgery may be\nfairly adduced as an argument that it is not a forgery at all. In this\nuncertainty the express testimony of Aristotle, who quotes, in the\nRhetoric, the well-known words, 'It is easy to praise the Athenians\namong the Athenians,' from the Funeral Oration, may perhaps turn the\nbalance in its favour. It must be remembered also that the work was\nfamous in antiquity, and is included in the Alexandrian catalogues of\nPlatonic writings.",
    "PERSONS OF THE DIALOGUE: Socrates and Menexenus.",
    "SOCRATES: Whence come you, Menexenus? Are you from the Agora?",
    "MENEXENUS: Yes, Socrates; I have been at the Council.",
    "SOCRATES: And what might you be doing at the Council? And yet I need\nhardly ask, for I see that you, believing yourself to have arrived at\nthe end of education and of philosophy, and to have had enough of them,\nare mounting upwards to things higher still, and, though rather young\nfor the post, are intending to govern us elder men, like the rest of\nyour family, which has always provided some one who kindly took care of\nus.",
    "MENEXENUS: Yes, Socrates, I shall be ready to hold office, if you allow\nand advise that I should, but not if you think otherwise. I went to the\ncouncil chamber because I heard that the Council was about to choose\nsome one who was to speak over the dead. For you know that there is to\nbe a public funeral?",
    "SOCRATES: Yes, I know. And whom did they choose?",
    "MENEXENUS: No one; they delayed the election until tomorrow, but I\nbelieve that either Archinus or Dion will be chosen.",
    "SOCRATES: O Menexenus! Death in battle is certainly in many respects a\nnoble thing. The dead man gets a fine and costly funeral, although he\nmay have been poor, and an elaborate speech is made over him by a wise\nman who has long ago prepared what he has to say, although he who is\npraised may not have been good for much. The speakers praise him for\nwhat he has done and for what he has not done--that is the beauty of\nthem--and they steal away our souls with their embellished words; in\nevery conceivable form they praise the city; and they praise those who\ndied in war, and all our ancestors who went before us; and they praise\nourselves also who are still alive, until I feel quite elevated by their\nlaudations, and I stand listening to their words, Menexenus, and become\nenchanted by them, and all in a moment I imagine myself to have become\na greater and nobler and finer man than I was before. And if, as often\nhappens, there are any foreigners who accompany me to the speech, I\nbecome suddenly conscious of having a sort of triumph over them, and\nthey seem to experience a corresponding feeling of admiration at me, and\nat the greatness of the city, which appears to them, when they are\nunder the influence of the speaker, more wonderful than ever. This\nconsciousness of dignity lasts me more than three days, and not until\nthe fourth or fifth day do I come to my senses and know where I am; in\nthe meantime I have been living in the Islands of the Blest. Such is\nthe art of our rhetoricians, and in such manner does the sound of their\nwords keep ringing in my ears.",
    "MENEXENUS: You are always making fun of the rhetoricians, Socrates; this\ntime, however, I am inclined to think that the speaker who is chosen\nwill not have much to say, for he has been called upon to speak at a\nmoment's notice, and he will be compelled almost to improvise.",
    "SOCRATES: But why, my friend, should he not have plenty to say? Every\nrhetorician has speeches ready made; nor is there any difficulty in\nimprovising that sort of stuff. Had the orator to praise Athenians among\nPeloponnesians, or Peloponnesians among Athenians, he must be a\ngood rhetorician who could succeed and gain credit. But there is no\ndifficulty in a man's winning applause when he is contending for fame\namong the persons whom he is praising.",
    "MENEXENUS: Do you think not, Socrates?",
    "SOCRATES: Certainly 'not.'",
    "MENEXENUS: Do you think that you could speak yourself if there should be\na necessity, and if the Council were to choose you?",
    "SOCRATES: That I should be able to speak is no great wonder,\nMenexenus, considering that I have an excellent mistress in the art of\nrhetoric,--she who has made so many good speakers, and one who was the\nbest among all the Hellenes--Pericles, the son of Xanthippus.",
    "MENEXENUS: And who is she? I suppose that you mean Aspasia.",
    "SOCRATES: Yes, I do; and besides her I had Connus, the son of Metrobius,\nas a master, and he was my master in music, as she was in rhetoric.\nNo wonder that a man who has received such an education should be a\nfinished speaker; even the pupil of very inferior masters, say, for\nexample, one who had learned music of Lamprus, and rhetoric of Antiphon\nthe Rhamnusian, might make a figure if he were to praise the Athenians\namong the Athenians.",
    "MENEXENUS: And what would you be able to say if you had to speak?",
    "SOCRATES: Of my own wit, most likely nothing; but yesterday I heard\nAspasia composing a funeral oration about these very dead. For she had\nbeen told, as you were saying, that the Athenians were going to choose\na speaker, and she repeated to me the sort of speech which he should\ndeliver, partly improvising and partly from previous thought, putting\ntogether fragments of the funeral oration which Pericles spoke, but\nwhich, as I believe, she composed.",
    "MENEXENUS: And can you remember what Aspasia said?",
    "SOCRATES: I ought to be able, for she taught me, and she was ready to\nstrike me because I was always forgetting.",
    "MENEXENUS: Then why will you not rehearse what she said?",
    "SOCRATES: Because I am afraid that my mistress may be angry with me if I\npublish her speech.",
    "MENEXENUS: Nay, Socrates, let us have the speech, whether Aspasia's or\nany one else's, no matter. I hope that you will oblige me.",
    "SOCRATES: But I am afraid that you will laugh at me if I continue the\ngames of youth in old age.",
    "MENEXENUS: Far otherwise, Socrates; let us by all means have the speech.",
    "SOCRATES: Truly I have such a disposition to oblige you, that if you bid\nme dance naked I should not like to refuse, since we are alone. Listen\nthen: If I remember rightly, she began as follows, with the mention of\nthe dead:--(Thucyd.)",
    "There is a tribute of deeds and of words. The departed have already had\nthe first, when going forth on their destined journey they were attended\non their way by the state and by their friends; the tribute of words\nremains to be given to them, as is meet and by law ordained. For noble\nwords are a memorial and a crown of noble actions, which are given\nto the doers of them by the hearers. A word is needed which will duly\npraise the dead and gently admonish the living, exhorting the brethren\nand descendants of the departed to imitate their virtue, and consoling\ntheir fathers and mothers and the survivors, if any, who may chance to\nbe alive of the previous generation. What sort of a word will this be,\nand how shall we rightly begin the praises of these brave men? In their\nlife they rejoiced their own friends with their valour, and their death\nthey gave in exchange for the salvation of the living. And I think that\nwe should praise them in the order in which nature made them good, for\nthey were good because they were sprung from good fathers. Wherefore\nlet us first of all praise the goodness of their birth; secondly, their\nnurture and education; and then let us set forth how noble their actions\nwere, and how worthy of the education which they had received.",
    "And first as to their birth. Their ancestors were not strangers, nor are\nthese their descendants sojourners only, whose fathers have come from\nanother country; but they are the children of the soil, dwelling and\nliving in their own land. And the country which brought them up is not\nlike other countries, a stepmother to her children, but their own true\nmother; she bore them and nourished them and received them, and in her\nbosom they now repose. It is meet and right, therefore, that we should\nbegin by praising the land which is their mother, and that will be a way\nof praising their noble birth.",
    "The country is worthy to be praised, not only by us, but by all mankind;\nfirst, and above all, as being dear to the Gods. This is proved by the\nstrife and contention of the Gods respecting her. And ought not the\ncountry which the Gods praise to be praised by all mankind? The second\npraise which may be fairly claimed by her, is that at the time when the\nwhole earth was sending forth and creating diverse animals, tame and\nwild, she our mother was free and pure from savage monsters, and out of\nall animals selected and brought forth man, who is superior to the rest\nin understanding, and alone has justice and religion. And a great proof\nthat she brought forth the common ancestors of us and of the departed,\nis that she provided the means of support for her offspring. For as a\nwoman proves her motherhood by giving milk to her young ones (and she\nwho has no fountain of milk is not a mother), so did this our land prove\nthat she was the mother of men, for in those days she alone and first of\nall brought forth wheat and barley for human food, which is the best and\nnoblest sustenance for man, whom she regarded as her true offspring. And\nthese are truer proofs of motherhood in a country than in a woman, for\nthe woman in her conception and generation is but the imitation of the\nearth, and not the earth of the woman. And of the fruit of the earth she\ngave a plenteous supply, not only to her own, but to others also; and\nafterwards she made the olive to spring up to be a boon to her children,\nand to help them in their toils. And when she had herself nursed them\nand brought them up to manhood, she gave them Gods to be their rulers\nand teachers, whose names are well known, and need not now be repeated.\nThey are the Gods who first ordered our lives, and instructed us in the\narts for the supply of our daily needs, and taught us the acquisition\nand use of arms for the defence of the country.",
    "Thus born into the world and thus educated, the ancestors of the\ndeparted lived and made themselves a government, which I ought briefly\nto commemorate. For government is the nurture of man, and the government\nof good men is good, and of bad men bad. And I must show that our\nancestors were trained under a good government, and for this reason they\nwere good, and our contemporaries are also good, among whom our departed\nfriends are to be reckoned. Then as now, and indeed always, from that\ntime to this, speaking generally, our government was an aristocracy--a\nform of government which receives various names, according to the\nfancies of men, and is sometimes called democracy, but is really an\naristocracy or government of the best which has the approval of the\nmany. For kings we have always had, first hereditary and then elected,\nand authority is mostly in the hands of the people, who dispense offices\nand power to those who appear to be most deserving of them. Neither is\na man rejected from weakness or poverty or obscurity of origin, nor\nhonoured by reason of the opposite, as in other states, but there is one\nprinciple--he who appears to be wise and good is a governor and ruler.\nThe basis of this our government is equality of birth; for other states\nare made up of all sorts and unequal conditions of men, and therefore\ntheir governments are unequal; there are tyrannies and there are\noligarchies, in which the one party are slaves and the others masters.\nBut we and our citizens are brethren, the children all of one mother,\nand we do not think it right to be one another's masters or servants;\nbut the natural equality of birth compels us to seek for legal equality,\nand to recognize no superiority except in the reputation of virtue and\nwisdom.",
    "And so their and our fathers, and these, too, our brethren, being nobly\nborn and having been brought up in all freedom, did both in their public\nand private capacity many noble deeds famous over the whole world. They\nwere the deeds of men who thought that they ought to fight both against\nHellenes for the sake of Hellenes on behalf of freedom, and against\nbarbarians in the common interest of Hellas. Time would fail me to tell\nof their defence of their country against the invasion of Eumolpus and\nthe Amazons, or of their defence of the Argives against the Cadmeians,\nor of the Heracleids against the Argives; besides, the poets have\nalready declared in song to all mankind their glory, and therefore any\ncommemoration of their deeds in prose which we might attempt would hold\na second place. They already have their reward, and I say no more of\nthem; but there are other worthy deeds of which no poet has worthily\nsung, and which are still wooing the poet's muse. Of these I am bound to\nmake honourable mention, and shall invoke others to sing of them also\nin lyric and other strains, in a manner becoming the actors. And first\nI will tell how the Persians, lords of Asia, were enslaving Europe, and\nhow the children of this land, who were our fathers, held them back.\nOf these I will speak first, and praise their valour, as is meet and\nfitting. He who would rightly estimate them should place himself in\nthought at that time, when the whole of Asia was subject to the third\nking of Persia. The first king, Cyrus, by his valour freed the Persians,\nwho were his countrymen, and subjected the Medes, who were their lords,\nand he ruled over the rest of Asia, as far as Egypt; and after him came\nhis son, who ruled all the accessible part of Egypt and Libya; the\nthird king was Darius, who extended the land boundaries of the empire to\nScythia, and with his fleet held the sea and the islands. None presumed\nto be his equal; the minds of all men were enthralled by him--so many\nand mighty and warlike nations had the power of Persia subdued. Now\nDarius had a quarrel against us and the Eretrians, because, as he said,\nwe had conspired against Sardis, and he sent 500,000 men in transports\nand vessels of war, and 300 ships, and Datis as commander, telling him\nto bring the Eretrians and Athenians to the king, if he wished to keep\nhis head on his shoulders. He sailed against the Eretrians, who were\nreputed to be amongst the noblest and most warlike of the Hellenes of\nthat day, and they were numerous, but he conquered them all in three\ndays; and when he had conquered them, in order that no one might escape,\nhe searched the whole country after this manner: his soldiers, coming to\nthe borders of Eretria and spreading from sea to sea, joined hands and\npassed through the whole country, in order that they might be able to\ntell the king that no one had escaped them. And from Eretria they went\nto Marathon with a like intention, expecting to bind the Athenians in\nthe same yoke of necessity in which they had bound the Eretrians. Having\neffected one-half of their purpose, they were in the act of attempting\nthe other, and none of the Hellenes dared to assist either the Eretrians\nor the Athenians, except the Lacedaemonians, and they arrived a day too\nlate for the battle; but the rest were panic-stricken and kept quiet,\ntoo happy in having escaped for a time. He who has present to his mind\nthat conflict will know what manner of men they were who received the\nonset of the barbarians at Marathon, and chastened the pride of the\nwhole of Asia, and by the victory which they gained over the barbarians\nfirst taught other men that the power of the Persians was not\ninvincible, but that hosts of men and the multitude of riches alike\nyield to valour. And I assert that those men are the fathers not only of\nourselves, but of our liberties and of the liberties of all who are on\nthe continent, for that was the action to which the Hellenes looked back\nwhen they ventured to fight for their own safety in the battles\nwhich ensued: they became disciples of the men of Marathon. To them,\ntherefore, I assign in my speech the first place, and the second\nto those who fought and conquered in the sea fights at Salamis and\nArtemisium; for of them, too, one might have many things to say--of the\nassaults which they endured by sea and land, and how they repelled them.\nI will mention only that act of theirs which appears to me to be the\nnoblest, and which followed that of Marathon and came nearest to it;\nfor the men of Marathon only showed the Hellenes that it was possible to\nward off the barbarians by land, the many by the few; but there was\nno proof that they could be defeated by ships, and at sea the Persians\nretained the reputation of being invincible in numbers and wealth and\nskill and strength. This is the glory of the men who fought at sea,\nthat they dispelled the second terror which had hitherto possessed the\nHellenes, and so made the fear of numbers, whether of ships or men, to\ncease among them. And so the soldiers of Marathon and the sailors\nof Salamis became the schoolmasters of Hellas; the one teaching and\nhabituating the Hellenes not to fear the barbarians at sea, and the\nothers not to fear them by land. Third in order, for the number and\nvalour of the combatants, and third in the salvation of Hellas, I\nplace the battle of Plataea. And now the Lacedaemonians as well as\nthe Athenians took part in the struggle; they were all united in this\ngreatest and most terrible conflict of all; wherefore their virtues will\nbe celebrated in times to come, as they are now celebrated by us. But\nat a later period many Hellenic tribes were still on the side of the\nbarbarians, and there was a report that the great king was going to make\na new attempt upon the Hellenes, and therefore justice requires that we\nshould also make mention of those who crowned the previous work of our\nsalvation, and drove and purged away all barbarians from the sea. These\nwere the men who fought by sea at the river Eurymedon, and who went\non the expedition to Cyprus, and who sailed to Egypt and divers other\nplaces; and they should be gratefully remembered by us, because they\ncompelled the king in fear for himself to look to his own safety instead\nof plotting the destruction of Hellas.",
    "And so the war against the barbarians was fought out to the end by the\nwhole city on their own behalf, and on behalf of their countrymen. There\nwas peace, and our city was held in honour; and then, as prosperity\nmakes men jealous, there succeeded a jealousy of her, and jealousy\nbegat envy, and so she became engaged against her will in a war with\nthe Hellenes. On the breaking out of war, our citizens met the\nLacedaemonians at Tanagra, and fought for the freedom of the Boeotians;\nthe issue was doubtful, and was decided by the engagement which\nfollowed. For when the Lacedaemonians had gone on their way, leaving the\nBoeotians, whom they were aiding, on the third day after the battle of\nTanagra, our countrymen conquered at Oenophyta, and righteously restored\nthose who had been unrighteously exiled. And they were the first after\nthe Persian war who fought on behalf of liberty in aid of Hellenes\nagainst Hellenes; they were brave men, and freed those whom they aided,\nand were the first too who were honourably interred in this sepulchre by\nthe state. Afterwards there was a mighty war, in which all the Hellenes\njoined, and devastated our country, which was very ungrateful of them;\nand our countrymen, after defeating them in a naval engagement and\ntaking their leaders, the Spartans, at Sphagia, when they might have\ndestroyed them, spared their lives, and gave them back, and made peace,\nconsidering that they should war with the fellow-countrymen only until\nthey gained a victory over them, and not because of the private anger\nof the state destroy the common interest of Hellas; but that with\nbarbarians they should war to the death. Worthy of praise are they also\nwho waged this war, and are here interred; for they proved, if any one\ndoubted the superior prowess of the Athenians in the former war with\nthe barbarians, that their doubts had no foundation--showing by their\nvictory in the civil war with Hellas, in which they subdued the other\nchief state of the Hellenes, that they could conquer single-handed those\nwith whom they had been allied in the war against the barbarians.\nAfter the peace there followed a third war, which was of a terrible and\ndesperate nature, and in this many brave men who are here interred lost\ntheir lives--many of them had won victories in Sicily, whither they had\ngone over the seas to fight for the liberties of the Leontines, to\nwhom they were bound by oaths; but, owing to the distance, the city was\nunable to help them, and they lost heart and came to misfortune, their\nvery enemies and opponents winning more renown for valour and temperance\nthan the friends of others. Many also fell in naval engagements at the\nHellespont, after having in one day taken all the ships of the enemy,\nand defeated them in other naval engagements. And what I call the\nterrible and desperate nature of the war, is that the other Hellenes,\nin their extreme animosity towards the city, should have entered into\nnegotiations with their bitterest enemy, the king of Persia, whom they,\ntogether with us, had expelled;--him, without us, they again brought\nback, barbarian against Hellenes, and all the hosts, both of Hellenes\nand barbarians, were united against Athens. And then shone forth the\npower and valour of our city. Her enemies had supposed that she was\nexhausted by the war, and our ships were blockaded at Mitylene. But the\ncitizens themselves embarked, and came to the rescue with sixty other\nships, and their valour was confessed of all men, for they conquered\ntheir enemies and delivered their friends. And yet by some evil fortune\nthey were left to perish at sea, and therefore are not interred here.\nEver to be remembered and honoured are they, for by their valour not\nonly that sea-fight was won for us, but the entire war was decided\nby them, and through them the city gained the reputation of being\ninvincible, even though attacked by all mankind. And that reputation was\na true one, for the defeat which came upon us was our own doing. We were\nnever conquered by others, and to this day we are still unconquered by\nthem; but we were our own conquerors, and received defeat at our own\nhands. Afterwards there was quiet and peace abroad, but there sprang up\nwar at home; and, if men are destined to have civil war, no one could\nhave desired that his city should take the disorder in a milder form.\nHow joyful and natural was the reconciliation of those who came from the\nPiraeus and those who came from the city; with what moderation did they\norder the war against the tyrants in Eleusis, and in a manner how unlike\nwhat the other Hellenes expected! And the reason of this gentleness was\nthe veritable tie of blood, which created among them a friendship as of\nkinsmen, faithful not in word only, but in deed. And we ought also\nto remember those who then fell by one another's hands, and on such\noccasions as these to reconcile them with sacrifices and prayers,\npraying to those who have power over them, that they may be reconciled\neven as we are reconciled. For they did not attack one another out of\nmalice or enmity, but they were unfortunate. And that such was the fact\nwe ourselves are witnesses, who are of the same race with them, and\nhave mutually received and granted forgiveness of what we have done and\nsuffered. After this there was perfect peace, and the city had rest;\nand her feeling was that she forgave the barbarians, who had severely\nsuffered at her hands and severely retaliated, but that she was\nindignant at the ingratitude of the Hellenes, when she remembered how\nthey had received good from her and returned evil, having made common\ncause with the barbarians, depriving her of the ships which had once\nbeen their salvation, and dismantling our walls, which had preserved\ntheir own from falling. She thought that she would no longer defend the\nHellenes, when enslaved either by one another or by the barbarians, and\ndid accordingly. This was our feeling, while the Lacedaemonians were\nthinking that we who were the champions of liberty had fallen, and that\ntheir business was to subject the remaining Hellenes. And why should I\nsay more? for the events of which I am speaking happened not long ago\nand we can all of us remember how the chief peoples of Hellas, Argives\nand Boeotians and Corinthians, came to feel the need of us, and, what is\nthe greatest miracle of all, the Persian king himself was driven to such\nextremity as to come round to the opinion, that from this city, of which\nhe was the destroyer, and from no other, his salvation would proceed.",
    "And if a person desired to bring a deserved accusation against our city,\nhe would find only one charge which he could justly urge--that she was\ntoo compassionate and too favourable to the weaker side. And in this\ninstance she was not able to hold out or keep her resolution of refusing\naid to her injurers when they were being enslaved, but she was softened,\nand did in fact send out aid, and delivered the Hellenes from slavery,\nand they were free until they afterwards enslaved themselves. Whereas,\nto the great king she refused to give the assistance of the state, for\nshe could not forget the trophies of Marathon and Salamis and Plataea;\nbut she allowed exiles and volunteers to assist him, and they were his\nsalvation. And she herself, when she was compelled, entered into the\nwar, and built walls and ships, and fought with the Lacedaemonians on\nbehalf of the Parians. Now the king fearing this city and wanting to\nstand aloof, when he saw the Lacedaemonians growing weary of the war\nat sea, asked of us, as the price of his alliance with us and the other\nallies, to give up the Hellenes in Asia, whom the Lacedaemonians had\npreviously handed over to him, he thinking that we should refuse, and\nthat then he might have a pretence for withdrawing from us. About\nthe other allies he was mistaken, for the Corinthians and Argives and\nBoeotians, and the other states, were quite willing to let them go, and\nswore and covenanted, that, if he would pay them money, they would make\nover to him the Hellenes of the continent, and we alone refused to give\nthem up and swear. Such was the natural nobility of this city, so sound\nand healthy was the spirit of freedom among us, and the instinctive\ndislike of the barbarian, because we are pure Hellenes, having\nno admixture of barbarism in us. For we are not like many others,\ndescendants of Pelops or Cadmus or Egyptus or Danaus, who are by nature\nbarbarians, and yet pass for Hellenes, and dwell in the midst of us;\nbut we are pure Hellenes, uncontaminated by any foreign element, and\ntherefore the hatred of the foreigner has passed unadulterated into the\nlife-blood of the city. And so, notwithstanding our noble sentiments, we\nwere again isolated, because we were unwilling to be guilty of the base\nand unholy act of giving up Hellenes to barbarians. And we were in the\nsame case as when we were subdued before; but, by the favour of Heaven,\nwe managed better, for we ended the war without the loss of our ships or\nwalls or colonies; the enemy was only too glad to be quit of us. Yet in\nthis war we lost many brave men, such as were those who fell owing to\nthe ruggedness of the ground at the battle of Corinth, or by treason at\nLechaeum. Brave men, too, were those who delivered the Persian king,\nand drove the Lacedaemonians from the sea. I remind you of them, and you\nmust celebrate them together with me, and do honour to their memories.",
    "Such were the actions of the men who are here interred, and of others\nwho have died on behalf of their country; many and glorious things\nI have spoken of them, and there are yet many more and more glorious\nthings remaining to be told--many days and nights would not suffice to\ntell of them. Let them not be forgotten, and let every man remind their\ndescendants that they also are soldiers who must not desert the ranks\nof their ancestors, or from cowardice fall behind. Even as I exhort you\nthis day, and in all future time, whenever I meet with any of you, shall\ncontinue to remind and exhort you, O ye sons of heroes, that you strive\nto be the bravest of men. And I think that I ought now to repeat what\nyour fathers desired to have said to you who are their survivors, when\nthey went out to battle, in case anything happened to them. I will tell\nyou what I heard them say, and what, if they had only speech, they would\nfain be saying, judging from what they then said. And you must imagine\nthat you hear them saying what I now repeat to you:--",
    "'Sons, the event proves that your fathers were brave men; for we might\nhave lived dishonourably, but have preferred to die honourably rather\nthan bring you and your children into disgrace, and rather than\ndishonour our own fathers and forefathers; considering that life is\nnot life to one who is a dishonour to his race, and that to such a one\nneither men nor Gods are friendly, either while he is on the earth or\nafter death in the world below. Remember our words, then, and whatever\nis your aim let virtue be the condition of the attainment of your\naim, and know that without this all possessions and pursuits are\ndishonourable and evil. For neither does wealth bring honour to the\nowner, if he be a coward; of such a one the wealth belongs to another,\nand not to himself. Nor does beauty and strength of body, when dwelling\nin a base and cowardly man, appear comely, but the reverse of comely,\nmaking the possessor more conspicuous, and manifesting forth his\ncowardice. And all knowledge, when separated from justice and virtue,\nis seen to be cunning and not wisdom; wherefore make this your first\nand last and constant and all-absorbing aim, to exceed, if possible, not\nonly us but all your ancestors in virtue; and know that to excel you in\nvirtue only brings us shame, but that to be excelled by you is a source\nof happiness to us. And we shall most likely be defeated, and you will\nmost likely be victors in the contest, if you learn so to order your\nlives as not to abuse or waste the reputation of your ancestors, knowing\nthat to a man who has any self-respect, nothing is more dishonourable\nthan to be honoured, not for his own sake, but on account of the\nreputation of his ancestors. The honour of parents is a fair and noble\ntreasure to their posterity, but to have the use of a treasure of wealth\nand honour, and to leave none to your successors, because you\nhave neither money nor reputation of your own, is alike base and\ndishonourable. And if you follow our precepts you will be received by\nus as friends, when the hour of destiny brings you hither; but if you\nneglect our words and are disgraced in your lives, no one will welcome\nor receive you. This is the message which is to be delivered to our\nchildren.",
    "'Some of us have fathers and mothers still living, and we would urge\nthem, if, as is likely, we shall die, to bear the calamity as lightly\nas possible, and not to condole with one another; for they have sorrows\nenough, and will not need any one to stir them up. While we gently heal\ntheir wounds, let us remind them that the Gods have heard the chief part\nof their prayers; for they prayed, not that their children might live\nfor ever, but that they might be brave and renowned. And this, which\nis the greatest good, they have attained. A mortal man cannot expect to\nhave everything in his own life turning out according to his will; and\nthey, if they bear their misfortunes bravely, will be truly deemed brave\nfathers of the brave. But if they give way to their sorrows, either they\nwill be suspected of not being our parents, or we of not being such as\nour panegyrists declare. Let not either of the two alternatives happen,\nbut rather let them be our chief and true panegyrists, who show in their\nlives that they are true men, and had men for their sons. Of old the\nsaying, \"Nothing too much,\" appeared to be, and really was, well said.\nFor he whose happiness rests with himself, if possible, wholly, and if\nnot, as far as is possible,--who is not hanging in suspense on other\nmen, or changing with the vicissitude of their fortune,--has his life\nordered for the best. He is the temperate and valiant and wise; and when\nhis riches come and go, when his children are given and taken away,\nhe will remember the proverb--\"Neither rejoicing overmuch nor grieving\novermuch,\" for he relies upon himself. And such we would have our\nparents to be--that is our word and wish, and as such we now offer\nourselves, neither lamenting overmuch, nor fearing overmuch, if we are\nto die at this time. And we entreat our fathers and mothers to retain\nthese feelings throughout their future life, and to be assured that they\nwill not please us by sorrowing and lamenting over us. But, if the dead\nhave any knowledge of the living, they will displease us most by making\nthemselves miserable and by taking their misfortunes too much to\nheart, and they will please us best if they bear their loss lightly and\ntemperately. For our life will have the noblest end which is vouchsafed\nto man, and should be glorified rather than lamented. And if they will\ndirect their minds to the care and nurture of our wives and children,\nthey will soonest forget their misfortunes, and live in a better and\nnobler way, and be dearer to us.",
    "'This is all that we have to say to our families: and to the state we\nwould say--Take care of our parents and of our sons: let her worthily\ncherish the old age of our parents, and bring up our sons in the right\nway. But we know that she will of her own accord take care of them, and\ndoes not need any exhortation of ours.'",
    "This, O ye children and parents of the dead, is the message which\nthey bid us deliver to you, and which I do deliver with the utmost\nseriousness. And in their name I beseech you, the children, to imitate\nyour fathers, and you, parents, to be of good cheer about yourselves;\nfor we will nourish your age, and take care of you both publicly and\nprivately in any place in which one of us may meet one of you who are\nthe parents of the dead. And the care of you which the city shows,\nyou know yourselves; for she has made provision by law concerning the\nparents and children of those who die in war; the highest authority is\nspecially entrusted with the duty of watching over them above all other\ncitizens, and they will see that your fathers and mothers have no wrong\ndone to them. The city herself shares in the education of the children,\ndesiring as far as it is possible that their orphanhood may not be felt\nby them; while they are children she is a parent to them, and when they\nhave arrived at man's estate she sends them to their several duties, in\nfull armour clad; and bringing freshly to their minds the ways of their\nfathers, she places in their hands the instruments of their fathers'\nvirtues; for the sake of the omen, she would have them from the first\nbegin to rule over their own houses arrayed in the strength and arms\nof their fathers. And as for the dead, she never ceases honouring them,\ncelebrating in common for all rites which become the property of each;\nand in addition to this, holding gymnastic and equestrian contests, and\nmusical festivals of every sort. She is to the dead in the place of a\nson and heir, and to their sons in the place of a father, and to their\nparents and elder kindred in the place of a guardian--ever and always\ncaring for them. Considering this, you ought to bear your calamity the\nmore gently; for thus you will be most endeared to the dead and to the\nliving, and your sorrows will heal and be healed. And now do you and\nall, having lamented the dead in common according to the law, go your\nways.",
    "You have heard, Menexenus, the oration of Aspasia the Milesian.",
    "MENEXENUS: Truly, Socrates, I marvel that Aspasia, who is only a woman,\nshould be able to compose such a speech; she must be a rare one.",
    "SOCRATES: Well, if you are incredulous, you may come with me and hear\nher.",
    "MENEXENUS: I have often met Aspasia, Socrates, and know what she is\nlike.",
    "SOCRATES: Well, and do you not admire her, and are you not grateful for\nher speech?",
    "MENEXENUS: Yes, Socrates, I am very grateful to her or to him who told\nyou, and still more to you who have told me.",
    "SOCRATES: Very good. But you must take care not to tell of me, and then\nat some future time I will repeat to you many other excellent political\nspeeches of hers.",
    "MENEXENUS: Fear not, only let me hear them, and I will keep the secret.",
    "SOCRATES: Then I will keep my promise."
  ]
}
